[[query-functions-graph]]
= Graph functions
:description: Graph functions provide information about the constituent graphs in composite databases


[[functions-graph-names]]
== graph.names()

Returns a list containing the names of all graphs on the current composite database.
It is only supported on link:{neo4j-docs-base-uri}/operations-manual/{page-version}/composite-databases[composite databases].

[source, cypher, role=noplay]
----
RETURN graph.names()
----

[role="queryresult",options="header,footer",cols="1*<m"]
----
graph.names()
["composite.first", "composite.second", "composite.third"]
Rows: 1
----

[[functions-graph-byname]]
== graph.byName()

Resolves a constituent graph by name.
It is only supported in the xref:clauses/use.adoc[`USE` clause], on link:{neo4j-docs-base-uri}/operations-manual/{page-version}/composite-databases[composite databases].

[source, cypher, role=noplay]
----
UNWIND graph.names() AS graphName
CALL {
  USE graph.byName(graphName)
  MATCH (n)
  RETURN n
}
RETURN n
----

Returns all nodes from all graphs on the current composite database.
