[[query-functions-graph]]
= Graph functions
:description: Graph functions provide information about the constituent graphs in composite databases


[[functions-graph-names]]
== graph.names()

Returns a list containing the names of all graphs on the current composite database.
It is only supported on link:{neo4j-docs-base-uri}/operations-manual/{page-version}/composite-databases[composite databases].

.+graph.names()+
======
.Setup
[source, cypher, indent=0]
----
CREATE DATABASE dba;
CREATE DATABASE dbb;
CREATE DATABASE dbc;
CREATE COMPOSITE DATABASE composite;
CREATE ALIAS composite.first FOR DATABASE dba;
CREATE ALIAS composite.second FOR DATABASE dbb;
CREATE ALIAS composite.third FOR DATABASE dbc;
----

.Query
[source, cypher, indent=0]
----
RETURN graph.names() AS name
----

The names of all graphs on the current composite database are returned.

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===

| +name+
| "composite.first"
| "composite.second"
| "composite.third"
1+d|Rows: 3

|===

======

[[functions-graph-propertiesByName]]
== graph.propertiesByName()

Returns a map containing the properties associated with the graph with the given name. The properties are set on the <<alias-management,alias>> that adds the graph as a constituent of a composite database.
It is only supported on link:{neo4j-docs-base-uri}/operations-manual/{page-version}/composite-databases[composite databases].

.+graph.propertiesByName()+
======
.Setup
[source, cypher, indent=0]
----
CREATE DATABASE dba;
CREATE DATABASE dbb;
CREATE DATABASE dbc;
CREATE COMPOSITE DATABASE composite;
CREATE ALIAS composite.first FOR DATABASE dba
  PROPERTIES {number: 1, tags: ['A', 'B']};
CREATE ALIAS composite.second FOR DATABASE dbb
  PROPERTIES {number: 0, tags: ['A']};
CREATE ALIAS composite.third FOR DATABASE dbc
  PROPERTIES {number: 2, tags: ['B', 'C']};
----

.Query
[source, cypher, indent=0]
----
UNWIND graph.names() AS name
RETURN name, graph.propertiesByName(name) AS props
----

Properties for all graphs on the current composite database are returned.

.Result
[role="queryresult",options="header,footer",cols="2*<m"]
|===

| +name+ | +props+
| "composite.first"  | {number: 1, tags: ["A", "B"]}
| "composite.second" | {number: 0, tags: ["A"]}
| "composite.third"  | {number: 2, tags: ["B", "C"]}
2+d|Rows: 3

|===

======

[[functions-graph-byname]]
== graph.byName()

Resolves a constituent graph by name.
It is only supported in the xref:clauses/use.adoc[`USE` clause], on link:{neo4j-docs-base-uri}/operations-manual/{page-version}/composite-databases[composite databases].

.+graph.byName()+
======

.Query
[source, cypher, indent=0]

[source, cypher, role=noplay]
----
UNWIND graph.names() AS graphName
CALL {
  USE graph.byName(graphName)
  MATCH (n)
  RETURN n
}
RETURN n
----

Returns all nodes from all graphs on the current composite database.

======