:description: Functions that operate on numeric expressions only, and will return an error if used on any other values.

[[query-functions-numeric]]
= Mathematical functions - numeric

[abstract]
--
These functions all operate on numeric expressions only, and will return an error if used on any other values.
See also xref::syntax/operators.adoc#query-operators-mathematical[Mathematical operators].
--

Functions:

* xref::functions/mathematical-numeric.adoc#functions-abs[abs()]
* xref::functions/mathematical-numeric.adoc#functions-ceil[ceil()]
* xref::functions/mathematical-numeric.adoc#functions-floor[floor()]
* xref::functions/mathematical-numeric.adoc#functions-rand[rand()]
* xref::functions/mathematical-numeric.adoc#functions-round[round()]
* xref::functions/mathematical-numeric.adoc#functions-round2[round(), with precision]
* xref::functions/mathematical-numeric.adoc#functions-round3[round(), with precision and rounding mode]
* xref::functions/mathematical-numeric.adoc#functions-sign[sign()]

The following graph is used for the examples below:

image:graph_numeric_functions.svg[]

////
CREATE
  (alice:A {name:'Alice', age: 38, eyes: 'brown'}),
  (bob:B {name: 'Bob', age: 25, eyes: 'blue'}),
  (charlie:C {name: 'Charlie', age: 53, eyes: 'green'}),
  (daniel:D {name: 'Daniel', age: 54, eyes: 'brown'}),
  (eskil:E {name: 'Eskil', age: 41, eyes: 'blue', array: ['one', 'two', 'three']}),
  (alice)-[:KNOWS]->(bob),
  (alice)-[:KNOWS]->(charlie),
  (bob)-[:KNOWS]->(daniel),
  (charlie)-[:KNOWS]->(daniel),
  (bob)-[:MARRIED]->(eskil)
////


[[functions-abs]]
== abs()

`abs()` returns the absolute value of the given number.

*Syntax:*

[source, syntax, role="noheader"]
----
abs(expression)
----

*Returns:*

|===

| The type of the value returned will be that of `expression`.

|===

*Arguments:*

[options="header"]
|===
| Name | Description

| `expression`
| A numeric expression.

|===

*Considerations:*

|===

| `abs(null)` returns `null`.
| If `expression` is negative, `-(expression)` (i.e. the _negation_ of `expression`) is returned.

|===

.+abs()+
======

.Query
[source, cypher, indent=0]
----
MATCH (a), (e) WHERE a.name = 'Alice' AND e.name = 'Eskil' RETURN a.age, e.age, abs(a.age - e.age)
----

The absolute value of the age difference is returned.

.Result
[role="queryresult",options="header,footer",cols="3*<m"]
|===

| +a.age+ | +e.age+ | +abs(a.age - e.age)+
| +38+ | +41+ | +3+
3+d|Rows: 1

|===

======


[[functions-ceil]]
== ceil()

`ceil()` returns the smallest floating point number that is greater than or equal to the given number and equal to a mathematical integer.

*Syntax:*

[source, syntax, role="noheader"]
----
ceil(expression)
----

*Returns:*

|===

| A Float.

|===

*Arguments:*

[options="header"]
|===
| Name | Description

| `expression`
| A numeric expression.

|===

*Considerations:*

|===

| `ceil(null)` returns `null`.

|===


.+ceil()+
======

.Query
[source, cypher, indent=0]
----
RETURN ceil(0.1)
----

The ceil of `0.1` is returned.

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===

| +ceil(0.1)+
| +1.0+
1+d|Rows: 1

|===

======


[[functions-floor]]
== floor()

`floor()` returns the largest floating point number that is less than or equal to the given number and equal to a mathematical integer.

*Syntax:*

[source, syntax, role="noheader"]
----
floor(expression)
----

*Returns:*

|===

| A Float.

|===

*Arguments:*

[options="header"]
|===
| Name | Description

| `expression`
| A numeric expression.

|===

*Considerations:*

|===

| `floor(null)` returns `null`.

|===


.+floor()+
======

.Query
[source, cypher, indent=0]
----
RETURN floor(0.9)
----

The floor of `0.9` is returned.

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===
| +floor(0.9)+
| +0.0+
1+d|Rows: 1
|===

======


[[functions-rand]]
== rand()

`rand()` returns a random floating point number in the range from 0 (inclusive) to 1 (exclusive); i.e. `[0,1)`. The numbers returned follow an approximate uniform distribution.

*Syntax:*

[source, syntax, role="noheader"]
----
rand()
----

*Returns:*

|===

| A Float.

|===


.+rand()+
======

.Query
[source, cypher, indent=0]
----
RETURN rand()
----

A random number is returned.

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===

| +rand()+
| +0.5460251846326871+
1+d|Rows: 1

|===

======


[[functions-round]]
== round()

`round()` returns the value of the given number rounded to the nearest integer, with half-way values always rounded up.

*Syntax:*

[source, syntax, role="noheader"]
----
round(expression)
----

*Returns:*

|===

| A Float.

|===

*Arguments:*

[options="header"]
|===
| Name | Description

| `expression`
| A numeric expression to be rounded.

|===

*Considerations:*

|===

| `round(null)` returns `null`.

|===


.+round()+
======

.Query
[source, cypher, indent=0]
----
RETURN round(3.141592)
----

`3.0` is returned.

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===
| +round(3.141592)+
| +3.0+
1+d|Rows: 1
|===

======


[[functions-round2]]
== round(), with precision

`round()` returns the value of the given number rounded with the specified precision, with half-values always being rounded up.

*Syntax:*

[source, syntax, role="noheader"]
----
round(expression, precision)
----

*Returns:*
|===

| A Float.

|===

*Arguments:*

[options="header"]
|===
| Name | Description

| `expression`
| A numeric expression to be rounded.

| `precision`
| A numeric expression specifying precision.

|===

*Considerations:*

|===

| `round(null)` returns `null`.

|===


.+round()+
======

.Query
[source, cypher, indent=0]
----
RETURN round(3.141592, 3)
----

`3.142` is returned.

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===

| +round(3.141592, 3)+
| +3.142+
1+d|Rows: 1

|===

======


[[functions-round3]]
== round(), with precision and rounding mode

`round()` returns the value of the given number rounded with the specified precision and the specified rounding mode.

*Syntax:*

[source, syntax, role="noheader"]
----
round(expression, precision, mode)
----

*Returns:*

|===

| A Float.

|===

*Arguments:*

[options="header"]
|===
| Name | Description

| `expression`
| A numeric expression to be rounded.

| `precision`
| A numeric expression specifying precision.

| `mode`
| A string expression specifying rounding mode.

|===

*Modes:*
[options="header"]
|===
| `Mode` | Description

| `CEILING`
| Round towards positive infinity.

| `DOWN`
| Round towards zero.

| `FLOOR`
| Round towards zero.

| `HALF_DOWN`
| Round towards closest value of given precision, with half-values always being rounded down.

| `HALF_EVEN`
| Round towards closest value of given precision, with half-values always being rounded to the even neighbor.

| `HALF_UP`
| Round towards closest value of given precision, with half-values always being rounded up.

| `UP`
| Round away from zero.

|===

*Considerations:*

|===

| `round(null)` returns `null`.

|===


.+round()+
======

.Query
[source, cypher, indent=0]
----
RETURN round(3.141592, 2, 'CEILING')
----

`3.15` is returned.

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===

| +round(3.141592, 2, 'CEILING')+
| +3.15+
1+d|Rows: 1

|===

======


[[functions-sign]]
== sign()

`sign()` returns the signum of the given number: `0` if the number is `0`, `-1` for any negative number, and `1` for any positive number.

*Syntax:*

[source, syntax, role="noheader"]
----
sign(expression)
----

*Returns:*

|===

| An Integer.

|===

*Arguments:*

[options="header"]
|===
| Name | Description

| `expression`
| A numeric expression.

|===

*Considerations:*

|===

| `sign(null)` returns `null`.

|===


.+sign()+
======

.Query
[source, cypher, indent=0]
----
RETURN sign(-17), sign(0.1)
----

The signs of `-17` and `0.1` are returned.

.Result
[role="queryresult",options="header,footer",cols="2*<m"]
|===

| +sign(-17)+ | +sign(0.1)+
| +-1+ | +1+
2+d|Rows: 1

|===

======

