[[query-functions-user-defined]]
= User-defined functions
:description: User-defined functions are written in Java, deployed into the database and are called in the same way as any other Cypher function. 

There are two main types of functions that can be developed and used:

[options="header"]
|===
|Type        | Description                                                     | Usage                              | Developing
|Scalar      | For each row the function takes parameters and returns a result | xref:functions/user-defined.adoc#query-functions-udf[Using UDF] | link:{neo4j-docs-base-uri}/java-reference/{page-version}/extending-neo4j/functions#extending-neo4j-functions[Extending Neo4j (UDF)]
|Aggregating | Consumes many rows and produces an aggregated result            | xref:functions/user-defined.adoc#query-functions-user-defined-aggregation[Using aggregating UDF] | link:{neo4j-docs-base-uri}/java-reference/{page-version}/extending-neo4j/aggregation-functions#extending-neo4j-aggregation-functions[Extending Neo4j (Aggregating UDF)]
|===

// User-defined functions

// tag::neo4j-cypher-docs/docs/dev/ql/functions/query-functions-udf.adoc[]
// tag::include-neo4j-documentation[]
[[query-functions-udf]]
== User-defined scalar functions


For each incoming row the function takes parameters and returns a single result.


This example shows how you invoke a user-defined function called `join` from Cypher.

=== Call a user-defined function

This calls the user-defined function `org.neo4j.procedure.example.join()`.


.Query
[source, cypher]
----
MATCH (n:Member) RETURN org.neo4j.function.example.join(collect(n.name)) AS members
----

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===
| +members+
| +"John,Paul,George,Ringo"+
1+d|Rows: 1
|===

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
UNWIND ["John", "Paul", "George", "Ringo"] as name CREATE (:Member {name: name})

]]></database><command><![CDATA[
MATCH (n:Member) RETURN org.neo4j.function.example.join(collect(n.name)) AS members
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]


For developing and deploying user-defined functions in Neo4j, see link:{neo4j-docs-base-uri}/java-reference/{page-version}/extending-neo4j/functions#extending-neo4j-functions[Extending Neo4j -> User-defined functions].

// end::include-neo4j-documentation[]
// end::neo4j-cypher-docs/docs/dev/ql/functions/query-functions-udf.adoc[]

// User-defined aggregating functions

// tag::neo4j-cypher-docs/docs/dev/ql/functions/query-functions-user-defined-aggregation.adoc[]
// tag::include-neo4j-documentation[]
[[query-functions-user-defined-aggregation]]
== User-defined aggregation functions

Aggregating functions consume many rows and produces a single aggregated result.

This example shows how you invoke a user-defined aggregation function called `longestString` from Cypher.

[[functions-call-a-user-defined-aggregation-function]]
== Call a user-defined aggregation function

This calls the user-defined function `org.neo4j.function.example.longestString()`.


.Query
[source, cypher]
----
MATCH (n:Member)
RETURN org.neo4j.function.example.longestString(n.name) AS member
----

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===
| +member+
| +"George"+
1+d|Rows: 1
|===

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
UNWIND ['John', 'Paul', 'George', 'Ringe'] AS beatle
CREATE (:Member {name: beatle})

]]></database><command><![CDATA[
MATCH (n:Member)
RETURN org.neo4j.function.example.longestString(n.name) AS member
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]

// end::include-neo4j-documentation[]
// end::neo4j-cypher-docs/docs/dev/ql/functions/query-functions-user-defined-aggregation.adoc[]
