:description: User-defined functions are written in Java, deployed into the database and are called in the same way as any other Cypher function.

[[query-functions-user-defined]]
= User-defined functions

[abstract]
--
User-defined functions are written in Java, deployed into the database and are called in the same way as any other Cypher function.
--

There are two main types of functions that can be developed and used:

[options="header"]
|===
| Type | Description | Usage | Developing

| Scalar
| For each row the function takes parameters and returns a result.
| xref::functions/user-defined.adoc#query-functions-udf[Using UDF]
| xref:4.4@java-reference:ROOT:extending-neo4j/functions.adoc#extending-neo4j-functions[Extending Neo4j (UDF)]

| Aggregating
| Consumes many rows and produces an aggregated result.
| xref::functions/user-defined.adoc#query-functions-user-defined-aggregation[Using aggregating UDF]
| xref:4.4@java-reference:ROOT:extending-neo4j/aggregation-functions.adoc#extending-neo4j-aggregation-functions[Extending Neo4j (Aggregating UDF)]

|===


[[query-functions-udf]]
== User-defined scalar functions

For each incoming row the function takes parameters and returns a single result.

For developing and deploying user-defined functions in Neo4j, see xref:4.4@java-reference:ROOT:extending-neo4j/functions.adoc#extending-neo4j-functions[Extending Neo4j -> User-defined functions].


.Call a user-defined function
======

This example shows how you invoke a user-defined function called `join` from Cypher.

This calls the user-defined function `org.neo4j.procedure.example.join()`.

////
UNWIND ['John', 'Paul', 'George', 'Ringo'] AS name
CREATE (:Member {name: name})
////

.Query
[source, cypher, indent=0]
----
MATCH (n:Member)
RETURN org.neo4j.function.example.join(collect(n.name)) AS members
----

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===

| +members+
| +"John,Paul,George,Ringo"+
1+d|Rows: 1

|===

======


[[query-functions-user-defined-aggregation]]
== User-defined aggregation functions

Aggregating functions consume many rows and produces a single aggregated result.


.Call a user-defined aggregation function
======

This example shows how you invoke a user-defined aggregation function called `longestString` from Cypher.

This calls the user-defined function `org.neo4j.function.example.longestString()`.

////
UNWIND ['John', 'Paul', 'George', 'Ringe'] AS beatle
CREATE (:Member {name: beatle})
////

.Query
[source, cypher, indent=0]
----
MATCH (n:Member)
RETURN org.neo4j.function.example.longestString(n.name) AS member
----

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===

| +member+
| +"George"+
1+d|Rows: 1

|===

======

