[[query-limit]]
= LIMIT
:description: `LIMIT` constrains the number of returned rows. 

* xref:clauses/limit.adoc#limit-introduction[Introduction]
* xref:clauses/limit.adoc#limit-subset-rows[Return a subset of the rows]
* xref:clauses/limit.adoc#limit-subset-rows-using-expression[Using an expression with `LIMIT` to return a subset of the rows]

[[limit-introduction]]
== Introduction

`LIMIT` accepts any expression that evaluates to a positive integer -- however the expression cannot refer to nodes or relationships.

.Graph
["dot", "LIMIT-1.svg", "neoviz", ""]
----
  N0 [
    label = "name = \'A\'\l"
  ]
  N0 -> N4 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "KNOWS\n"
  ]
  N0 -> N3 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "KNOWS\n"
  ]
  N0 -> N2 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "KNOWS\n"
  ]
  N0 -> N1 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "KNOWS\n"
  ]
  N1 [
    label = "name = \'B\'\l"
  ]
  N2 [
    label = "name = \'C\'\l"
  ]
  N3 [
    label = "name = \'D\'\l"
  ]
  N4 [
    label = "name = \'E\'\l"
  ]

----
 

[[limit-subset-rows]]
== Return a limited subset of the rows

To return a limited subset of the rows, use this syntax:


.Query
[source, cypher]
----
MATCH (n)
RETURN n.name
ORDER BY n.name
LIMIT 3
----

Limit to 3 rows by the example query.

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===
| +n.name+
| +"A"+
| +"B"+
| +"C"+
1+d|Rows: 3
|===

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
CREATE
  (a {name: 'A'}),
  (b {name: 'B'}),
  (c {name: 'C'}),
  (d {name: 'D'}),
  (e {name: 'E'}),
  (a)-[:KNOWS]->(b),
  (a)-[:KNOWS]->(c),
  (a)-[:KNOWS]->(d),
  (a)-[:KNOWS]->(e)

]]></database><command><![CDATA[
MATCH (n)
RETURN n.name
ORDER BY n.name
LIMIT 3
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]

[[limit-subset-rows-using-expression]]
== Using an expression with `LIMIT` to return a subset of the rows

Limit accepts any expression that evaluates to a positive integer as long as it is not referring to any external variables:


.Query
[source, cypher]
----
MATCH (n)
RETURN n.name
ORDER BY n.name
LIMIT 1 + toInteger(3 * rand())
----

Limit 1 row plus randomly 0, 1, or 2. So randomly limit to 1, 2, or 3 rows.

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===
| +n.name+
| +"A"+
1+d|Rows: 1
|===

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
CREATE
  (a {name: 'A'}),
  (b {name: 'B'}),
  (c {name: 'C'}),
  (d {name: 'D'}),
  (e {name: 'E'}),
  (a)-[:KNOWS]->(b),
  (a)-[:KNOWS]->(c),
  (a)-[:KNOWS]->(d),
  (a)-[:KNOWS]->(e)

]]></database><command><![CDATA[
MATCH (n)
RETURN n.name
ORDER BY n.name
LIMIT 1 + toInteger(3 * rand())
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]

