[[query-limit]]
= LIMIT
:description: `LIMIT` constrains the number of returned rows. 

* xref:clauses/limit.adoc#limit-introduction[Introduction]
* xref:clauses/limit.adoc#limit-subset-rows[Return a subset of the rows]
* xref:clauses/limit.adoc#limit-subset-rows-using-expression[Using an expression with `LIMIT` to return a subset of the rows]
* xref:clauses/limit.adoc#limit-will-not-stop-side-effects[`LIMIT` will not stop side effects]

[[limit-introduction]]
== Introduction

`LIMIT` accepts any expression that evaluates to a positive integer -- however the expression cannot refer to nodes or relationships.

.Graph
["dot", "LIMIT-1.svg", "neoviz", ""]
----
  N0 [
    label = "name = \'A\'\l"
  ]
  N0 -> N4 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "KNOWS\n"
  ]
  N0 -> N3 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "KNOWS\n"
  ]
  N0 -> N2 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "KNOWS\n"
  ]
  N0 -> N1 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "KNOWS\n"
  ]
  N1 [
    label = "name = \'B\'\l"
  ]
  N2 [
    label = "name = \'C\'\l"
  ]
  N3 [
    label = "name = \'D\'\l"
  ]
  N4 [
    label = "name = \'E\'\l"
  ]

----
 

[[limit-subset-rows]]
== Return a limited subset of the rows

To return a limited subset of the rows, use this syntax:


.Query
[source, cypher]
----
MATCH (n)
RETURN n.name
ORDER BY n.name
LIMIT 3
----

Limit to 3 rows by the example query.

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===
| +n.name+
| +"A"+
| +"B"+
| +"C"+
1+d|Rows: 3
|===

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
CREATE
  (a {name: 'A'}),
  (b {name: 'B'}),
  (c {name: 'C'}),
  (d {name: 'D'}),
  (e {name: 'E'}),
  (a)-[:KNOWS]->(b),
  (a)-[:KNOWS]->(c),
  (a)-[:KNOWS]->(d),
  (a)-[:KNOWS]->(e)

]]></database><command><![CDATA[
MATCH (n)
RETURN n.name
ORDER BY n.name
LIMIT 3
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]

[[limit-subset-rows-using-expression]]
== Using an expression with `LIMIT` to return a subset of the rows

Limit accepts any expression that evaluates to a positive integer as long as it is not referring to any external variables:


.Query
[source, cypher]
----
MATCH (n)
RETURN n.name
ORDER BY n.name
LIMIT 1 + toInteger(3 * rand())
----

Limit 1 row plus randomly 0, 1, or 2. So randomly limit to 1, 2, or 3 rows.

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===
| +n.name+
| +"A"+
| +"B"+
1+d|Rows: 2
|===

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
CREATE
  (a {name: 'A'}),
  (b {name: 'B'}),
  (c {name: 'C'}),
  (d {name: 'D'}),
  (e {name: 'E'}),
  (a)-[:KNOWS]->(b),
  (a)-[:KNOWS]->(c),
  (a)-[:KNOWS]->(d),
  (a)-[:KNOWS]->(e)

]]></database><command><![CDATA[
MATCH (n)
RETURN n.name
ORDER BY n.name
LIMIT 1 + toInteger(3 * rand())
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]

[[limit-will-not-stop-side-effects]]
== `LIMIT` will not stop side effects

The use of `LIMIT` in a query will not stop side effects, like `CREATE`, `DELETE` or `SET`, from happening if the limit is in the same query part as the side effect.
This behaviour was undefined in versions before `4.3`.


.Query
[source, cypher]
----
CREATE (n)
RETURN n
LIMIT 0
----

This query returns nothing, but creates one node:

.Result
[role="queryresult",options="footer",cols="1*<m"]
|===
1+|(empty result)
1+d|Rows: 0 +
Nodes created: 1
|===

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
CREATE
  (a {name: 'A'}),
  (b {name: 'B'}),
  (c {name: 'C'}),
  (d {name: 'D'}),
  (e {name: 'E'}),
  (a)-[:KNOWS]->(b),
  (a)-[:KNOWS]->(c),
  (a)-[:KNOWS]->(d),
  (a)-[:KNOWS]->(e)

]]></database><command><![CDATA[
CREATE (n)
RETURN n
LIMIT 0
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]


.Query
[source, cypher]
----
MATCH (n {name: 'A'})
SET n.age = 60
RETURN n
LIMIT 0
----

This query returns nothing, but writes one property:

.Result
[role="queryresult",options="footer",cols="1*<m"]
|===
1+|(empty result)
1+d|Rows: 0 +
Properties set: 1
|===

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
CREATE
  (a {name: 'A'}),
  (b {name: 'B'}),
  (c {name: 'C'}),
  (d {name: 'D'}),
  (e {name: 'E'}),
  (a)-[:KNOWS]->(b),
  (a)-[:KNOWS]->(c),
  (a)-[:KNOWS]->(d),
  (a)-[:KNOWS]->(e)

]]></database><command><![CDATA[
MATCH (n {name: 'A'})
SET n.age = 60
RETURN n
LIMIT 0
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]

If we want to limit the number of updates we can split the query using the `WITH` clause:


.Query
[source, cypher]
----
MATCH (n)
WITH n LIMIT 1
SET n.locked = true
RETURN n
----

Writes `locked` property on one node and return that node:

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===
| +n+
| +Node[0]{locked:true,name:"A"}+
1+d|Rows: 1 +
Properties set: 1
|===

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
CREATE
  (a {name: 'A'}),
  (b {name: 'B'}),
  (c {name: 'C'}),
  (d {name: 'D'}),
  (e {name: 'E'}),
  (a)-[:KNOWS]->(b),
  (a)-[:KNOWS]->(c),
  (a)-[:KNOWS]->(d),
  (a)-[:KNOWS]->(e)

]]></database><command><![CDATA[
MATCH (n)
WITH n LIMIT 1
SET n.locked = true
RETURN n
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]

