[[query-remove]]
= REMOVE
:description: The `REMOVE` clause is used to remove properties from nodes and relationships, and to remove labels from nodes. 

* xref:clauses/remove.adoc#query-remove-introduction[Introduction]
* xref:clauses/remove.adoc#remove-remove-a-property[Remove a property]
* xref:clauses/remove.adoc#remove-remove-all-properties[Remove all properties]
* xref:clauses/remove.adoc#remove-remove-a-label-from-a-node[Remove a label from a node]
* xref:clauses/remove.adoc#remove-remove-multiple-labels[Remove multiple labels from a node]

[[query-remove-introduction]]
== Introduction

For deleting nodes and relationships, see xref:clauses/delete.adoc[DELETE].

[NOTE]
====
Removing labels from a node is an idempotent operation: if you try to remove a label from a node that does not have that label on it, nothing happens.
The query statistics will tell you if something needed to be done or not.


====

The examples use the following database:

.Graph
["dot", "REMOVE-1.svg", "neoviz", ""]
----
  N0 [
    label = "{Swedish|name = \'Andy\'\lage = 36\l}"
  ]
  N0 -> N2 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "KNOWS\n"
  ]
  N0 -> N1 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "KNOWS\n"
  ]
  N1 [
    label = "{Swedish|name = \'Timothy\'\lage = 25\l}"
  ]
  N2 [
    label = "{Swedish, German|name = \'Peter\'\lage = 34\l}"
  ]

----
 

[[remove-remove-a-property]]
== Remove a property

Neo4j doesn't allow storing `null` in properties.
Instead, if no value exists, the property is just not there.
So, `REMOVE` is used to remove a property value from a node or a relationship.


.Query
[source, cypher]
----
MATCH (a {name: 'Andy'})
REMOVE a.age
RETURN a.name, a.age
----

The node is returned, and no property `age` exists on it.

.Result
[role="queryresult",options="header,footer",cols="2*<m"]
|===
| +a.name+ | +a.age+
| +"Andy"+ | +<null>+
2+d|Rows: 1 +
Properties set: 1
|===

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
CREATE
  (a:Swedish {name: 'Andy', age: 36}),
  (t:Swedish {name: 'Timothy', age: 25}),
  (p:German:Swedish {name: 'Peter', age: 34}),
  (a)-[:KNOWS]->(t),
  (a)-[:KNOWS]->(p)

]]></database><command><![CDATA[
MATCH (a {name: 'Andy'})
REMOVE a.age
RETURN a.name, a.age
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]

[[remove-remove-all-properties]]
== Remove all properties

`REMOVE` cannot be used to remove all existing properties from a node or relationship.
Instead, using xref:clauses/set.adoc#set-remove-properties-using-empty-map[`SET` with `=` and an empty map as the right operand] will clear all properties from the node or relationship.

[[remove-remove-a-label-from-a-node]]
== Remove a label from a node

To remove labels, you use `REMOVE`.


.Query
[source, cypher]
----
MATCH (n {name: 'Peter'})
REMOVE n:German
RETURN n.name, labels(n)
----

.Result
[role="queryresult",options="header,footer",cols="2*<m"]
|===
| +n.name+ | +labels(n)+
| +"Peter"+ | +["Swedish"]+
2+d|Rows: 1 +
Labels removed: 1
|===

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
CREATE
  (a:Swedish {name: 'Andy', age: 36}),
  (t:Swedish {name: 'Timothy', age: 25}),
  (p:German:Swedish {name: 'Peter', age: 34}),
  (a)-[:KNOWS]->(t),
  (a)-[:KNOWS]->(p)

]]></database><command><![CDATA[
MATCH (n {name: 'Peter'})
REMOVE n:German
RETURN n.name, labels(n)
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]

[[remove-remove-multiple-labels]]
== Remove multiple labels from a node

To remove multiple labels, you use `REMOVE`.


.Query
[source, cypher]
----
MATCH (n {name: 'Peter'})
REMOVE n:German:Swedish
RETURN n.name, labels(n)
----

.Result
[role="queryresult",options="header,footer",cols="2*<m"]
|===
| +n.name+ | +labels(n)+
| +"Peter"+ | +[]+
2+d|Rows: 1 +
Labels removed: 2
|===

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
CREATE
  (a:Swedish {name: 'Andy', age: 36}),
  (t:Swedish {name: 'Timothy', age: 25}),
  (p:German:Swedish {name: 'Peter', age: 34}),
  (a)-[:KNOWS]->(t),
  (a)-[:KNOWS]->(p)

]]></database><command><![CDATA[
MATCH (n {name: 'Peter'})
REMOVE n:German:Swedish
RETURN n.name, labels(n)
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]

