:description: The `REMOVE` clause is used to remove properties from nodes and relationships, and to remove labels from nodes.

[[query-remove]]
= REMOVE

The `REMOVE` clause is used to remove properties from nodes and relationships, and to remove labels from nodes.

[TIP]
====
For deleting nodes and relationships, see xref::clauses/delete.adoc[`DELETE`].
====

[NOTE]
====
Removing labels from a node is an idempotent operation: if you try to remove a label from a node that does not have that label on it, nothing happens.
The query statistics will tell you if something needed to be done or not.
====

The examples use the following database:

image:graph_remove_clause.svg[]

////
[source, cypher, role=test-setup]
----
CREATE
  (a:Swedish {name: 'Andy', age: 36}),
  (t:Swedish {name: 'Timothy', age: 25}),
  (p:German:Swedish {name: 'Peter', age: 34}),
  (a)-[:KNOWS]->(t),
  (a)-[:KNOWS]->(p)
----
////


[[remove-remove-a-property]]
== Remove a property

Neo4j doesn't allow storing `null` in properties.
Instead, if no value exists, the property is just not there.
So, `REMOVE` is used to remove a property value from a node or a relationship.

.Query
[source, cypher, indent=0]
----
MATCH (a {name: 'Andy'})
REMOVE a.age
RETURN a.name, a.age
----

The node is returned, and no property `age` exists on it.

.Result
[role="queryresult",options="header,footer",cols="2*<m"]
|===
| a.name | a.age
| "Andy" | <null>
2+d|Rows: 1 +
Properties set: 1
|===


[[remove-remove-all-properties]]
== Remove all properties

`REMOVE` cannot be used to remove all existing properties from a node or relationship.
Instead, using xref::clauses/set.adoc#set-remove-properties-using-empty-map[`SET` with `=` and an empty map as the right operand] will clear all properties from the node or relationship.


[[remove-remove-a-label-from-a-node]]
== Remove a label from a node

To remove labels, you use `REMOVE`.

.Query
[source, cypher, indent=0]
----
MATCH (n {name: 'Peter'})
REMOVE n:German
RETURN n.name, labels(n)
----

.Result
[role="queryresult",options="header,footer",cols="2*<m"]
|===
| n.name | labels(n)
| "Peter" | ["Swedish"]
2+d|Rows: 1 +
Labels removed: 1
|===


[[remove-remove-multiple-labels]]
== Remove multiple labels from a node

To remove multiple labels, you use `REMOVE`.

.Query
[source, cypher, indent=0]
----
MATCH (n {name: 'Peter'})
REMOVE n:German:Swedish
RETURN n.name, labels(n)
----

.Result
[role="queryresult",options="header,footer",cols="2*<m"]
|===
| n.name | labels(n)
| "Peter" | []
2+d|Rows: 1 +
Labels removed: 2
|===

