:description: This section explains the `SHOW TRANSACTIONS` and `TERMINATION TRANSACTIONS` commands.

[[query-transaction-clauses]]
= Transaction commands

[abstract]
--
This section explains the `SHOW TRANSACTIONS` and `TERMINATION TRANSACTIONS` commands.
--

[[query-listing-transactions]]
== SHOW TRANSACTIONS

The `SHOW TRANSACTIONS` command is used to display running transactions within the instance.
This also includes fabric transactions.
For remote database aliases, transactions can be tracked by running `SHOW TRANSACTIONS` when connected to the remote database alias.

[NOTE]
====
The command `SHOW TRANSACTIONS` returns only the default output. For a full output use the optional `YIELD` command.
Full output: `SHOW TRANSACTIONS YIELD *`.
====

This command will produce a table with the following columns:

.List transactions output
[options="header", cols="4,6,2"]
|===
| Column | Description | Type

m| database
a| The name of the database the transaction is executing against. label:default-output[]
m| STRING

m| transactionId
a| The transaction ID. label:default-output[]
m| STRING

m| currentQueryId
a| The ID of the query currently executing in this transaction, or an empty string if no query is currently executing. label:default-output[]
m| STRING

m| connectionId
a| The ID of the database connection attached to the transaction or an empty string for embedded connections. label:default-output[]
m| STRING

m| clientAddress
a| The client address of the connection issuing the transaction or an empty string if unavailable. label:default-output[]
m| STRING

m| username
a| The username of the user executing the transaction. label:default-output[]
m| STRING

m| currentQuery
a| The query text of the query currently executing in this transaction, or an empty string if no query is currently executing. label:default-output[]
m| STRING

m| startTime
a| The time at which the transaction was started. label:default-output[]
m| STRING

m| status
a| The current status of the transaction (`Terminated`, `Blocked`, `Closing`, or `Running`). label:default-output[]
m| STRING

m| elapsedTime
a| The time that has elapsed since the transaction was started. label:default-output[]
m| DURATION

//Removed in 5.0
m| allocatedBytes
a| The number of bytes allocated on the heap so far by the transaction, or `0` if unavailable. label:default-output[]
m| LONG

m| outerTransactionId
a|
The ID of this transaction's outer transaction, if such exists, otherwise an empty string.
For details, see xref::clauses/call-subquery.adoc#subquery-call-in-transactions[`+CALL { ... } IN TRANSACTIONS+`].
m| STRING

m| metaData
a| Any metadata associated with the transaction, or an empty map if there is none.
m| MAP

m| parameters
a| A map containing all the parameters used by the query currently executing in this transaction, or an empty map if no query is currently executing.
m| MAP

m| planner
a|
The name of the Cypher planner used to plan the query currently executing in this transaction, or an empty string if no query is currently executing.
For details, see xref::query-tuning/index.adoc#cypher-planner[Cypher planner].
m| STRING

m| runtime
a| The name of the Cypher runtime used by the query currently executing in this transaction, or an empty string if no query is currently executing. For details, see xref::query-tuning/index.adoc#cypher-runtime[Cypher runtime].
m| STRING

m| indexes
a| The indexes utilised by the query currently executing in this transaction, or an empty list if no query is currently executing.
m| LIST OF MAP

// New in 5.0
// m| currentQueryStartTime
// a| The time at which the query currently executing in this transaction was started, or an empty string if no query is currently executing.
// m| STRING

m| protocol
a|
The protocol used by the connection issuing the transaction.
This is not necessarily an internet protocol, such as _http_, etc., although it could be.
It might also be "embedded", for example, if this connection represents an embedded session.
m| STRING

m| requestUri
a| The request URI used by the client connection issuing the transaction, or `null` if the URI is not available.
m| STRING

// New in 5.0
// m| currentQueryStatus
// a| The current status of the query currently executing in this transaction (`parsing`, `planning`, `planned`, `running`, or `waiting`), or an empty string if no query is currently executing.
// m| STRING

m| statusDetails
a| Provide additional status details from the underlying transaction or an empty string if none is available.
m| STRING

m| resourceInformation
a| Information about any blocked transactions, or an empty map if there is none.
m| MAP

m| activeLockCount
a| Count of active locks held by the transaction.
m| LONG

m| cpuTime
a| CPU time that has been actively spent executing the transaction or `null` if unavailable.
m| DURATION

m| waitTime
a| Wait time that has been spent waiting to acquire locks.
m| DURATION

m| idleTime
a| Idle time for this transaction, or `null` if unavailable.
m| DURATION

// New in 5.0
// m| currentQueryElapsedTime
// a| The time that has elapsed since the query currently executing in this transaction was started, or `null` if no query is currently executing.
// m| DURATION

// New in 5.0
// m| currentQueryCpuTime
// a| CPU time that has been actively spent executing the query currently executing in this transaction, or `null` if unavailable or no query is currently executing.
// m| DURATION

// New in 5.0
// m| currentQueryWaitTime
// a| Wait time that has been spent waiting to acquire locks for the query currently executing in this transaction, or `null` if no query is currently executing.
// m| DURATION

// New in 5.0
// m| currentQueryIdleTime
// a| Idle time for the query currently executing in this transaction, or `null` if unavailable or no query is currently executing.
// m| LONG

// New in 5.0
// m| currentQueryAllocatedBytes
// a| The number of bytes allocated on the heap so far by the query currently executing in this transaction, or `null` if unavailable or no query is currently executing.
// m| LONG

m| allocatedDirectBytes
a| Amount of off-heap (native) memory allocated by the transaction in bytes or `null` if unavailable.
m| LONG

m| estimatedUsedHeapMemory
a| The estimated amount of used heap memory allocated by the transaction in bytes or `null` if unavailable.
m| LONG

m| pageHits
a| The total number of page cache hits that the transaction performed.
m| LONG

m| pageFaults
a| The total number of page cache faults that the transaction performed.
m| LONG

// New in 5.0
// m| currentQueryPageHits
// a| The total number of page cache hits that the query currently executing in this transaction performed.
// m| LONG

// New in 5.0
// m| currentQueryPageFaults
// a| The total number of page cache faults that the query currently executing in this transaction performed.
// m| LONG

m| initializationStackTrace
a| The initialization stacktrace for this transaction, or an empty string if unavailable.
m| STRING

|===


=== Syntax

List transactions on the current server::

[source, cypher, role="noheader", indent=0]
----
SHOW TRANSACTION[S] [transaction-id[,...]]
[YIELD { * | field[, ...] } [ORDER BY field[, ...]] [SKIP n] [LIMIT n]]
[WHERE expression]
[RETURN field[, ...] [ORDER BY field[, ...]] [SKIP n] [LIMIT n]]
----

The format of `transaction-id` is `<databaseName>-transaction-<id>`. Transaction IDs must be supplied as a comma-separated list of one or more quoted strings, a string parameter, or a list parameter.

[NOTE]
====
When using the `RETURN` clause, the `YIELD` clause is mandatory and must not be omitted.
====

A user with the xref::access-control/database-administration.adoc#access-control-database-administration-transaction[`SHOW TRANSACTION`] privilege can view the currently executing transactions in accordance with the privilege grants.
All users may view all of their own currently executing transactions.


=== Listing all transactions

To list all available transactions with the default output columns, use the `SHOW TRANSACTIONS` command.
If all columns are required, use `SHOW TRANSACTIONS YIELD *`.

.Query
[source, cypher, indent=0]
----
SHOW TRANSACTIONS
----

.Result
[role="queryresult",options="header,footer",cols="11*<m"]
|===
| +database+ | +transactionId+ | +currentQueryId+ | +connectionId+ | +clientAddress+ | +username+ | +currentQuery+ | +startTime+ | +status+ | +elapsedTime+ | +allocatedBytes+

| +"neo4j"+ | +"neo4j-transaction-6"+ | +"query-664"+ | +""+ | +""+ | +""+ | +"SHOW TRANSACTIONS"+ | +"2022-06-14T10:02:45.568Z"+ | +"Running"+ | +PT0.038S+ | +0+
| +"neo4j"+ | +"neo4j-transaction-4"+ | +"query-663"+ | +""+ | +""+ | +""+ | +"MATCH (n) RETURN n"+ | +"2022-06-14T10:02:45.546Z"+ | +"Running"+ | +PT0.06S+ | +0+

11+d|Rows: 2
|===


=== Listing transactions with filtering on output columns

The listed transactions can be filtered by using the `WHERE` clause.
For example, getting the databases for all transactions where the currently executing query contains `'Mark'`:

.Query
[source, cypher, indent=0]
----
SHOW TRANSACTIONS YIELD database, currentQuery WHERE currentQuery contains 'Mark'
----

.Result
[role="queryresult",options="header,footer",cols="2*<m"]
|===
| +database+ | +currentQuery+

| +"neo4j"+ | +"MATCH (p:Person) WHERE p.name='Mark' RETURN p"+
| +"neo4j"+ | +"SHOW TRANSACTIONS YIELD database, currentQuery WHERE currentQuery contains 'Mark'"+

2+d|Rows: 2
|===

Several of the output columns have the `duration` type, which can be hard to read.
They can instead be returned in a more readable format:

.Query
[source, cypher, indent=0]
----
SHOW TRANSACTIONS
YIELD transactionId, elapsedTime, cpuTime, waitTime, idleTime
RETURN
  transactionId AS txId,
  elapsedTime.milliseconds AS elapsedTimeMillis,
  cpuTime.milliseconds AS cpuTimeMillis,
  waitTime.milliseconds AS waitTimeMillis,
  idleTime.seconds AS idleTimeSeconds
----

.Result
[role="queryresult",options="header,footer",cols="5*<m"]
|===
| +txId+ | +elapsedTimeMillis+ | +cpuTimeMillis+ | +waitTimeMillis+ | +idleTimeSeconds+

| +"neo4j-transaction-5"+ | +692+ | +19+ | +0+ | +0+
| +"neo4j-transaction-4"+ | +700+ | +577+ | +0+ | +0+
| +"neo4j-transaction-9"+ | +113+ | +110+ | +0+ | +0+

5+d|Rows: 3
|===


=== Listing specific transactions

It is possible to specify which transactions to return in the list by transaction ID.

.Query
[source, cypher, indent=0]
----
SHOW TRANSACTIONS "neo4j-transaction-3"
----

.Result
[role="queryresult",options="header,footer",cols="11*<m"]
|===
| +database+ | +transactionId+ | +currentQueryId+ | +connectionId+ | +clientAddress+ | +username+ | +currentQuery+ | +startTime+ | +status+ | +elapsedTime+ | +allocatedBytes+

| +"neo4j"+ | +"neo4j-transaction-3"+ | +"query-1"+ | +""+ | +""+ | +""+ | +"MATCH (n) RETURN n"+ | +"2021-10-20T08:29:39.423Z"+ | +"Running"+ | +PT2.603S+ | +0+

11+d|Rows: 1
|===


[[query-terminate-transactions]]
== TERMINATE TRANSACTIONS

The `TERMINATE TRANSACTIONS` command is used to terminate running transactions by their IDs.

This command will produce a table with the following columns:

.Terminate transactions output
[options="header", cols="4,6,2"]
|===
| Column | Description | Type

m|transactionId
a|The transaction ID.
m|STRING

m|username
a|The username of the user executing the transaction.
m|STRING

m|message
a|The result of the `TERMINATE TRANSACTION` command as applied to this transaction.
m|STRING
|===


=== Syntax

Terminate transactions by ID on the current server::

[source, cypher, role="noheader", indent=0]
----
TERMINATE TRANSACTION[S] transaction_id[, ...]
----

The format of `transaction-id` is `<databaseName>-transaction-<id>`. Transaction IDs must be supplied as a comma-separated list of one or more quoted strings, a string parameter, or a list parameter.

A user with the xref::access-control/database-administration.adoc#access-control-database-administration-transaction[`TERMINATE TRANSACTION`] privilege can terminate transactions in accordance with the privilege grants.
All users may terminate their own currently executing transactions.


=== Terminate transactions

To end running transactions without waiting for them to complete on their own, use the `TERMINATE TRANSACTIONS` command.

.Query
[source, cypher, indent=0]
----
TERMINATE TRANSACTIONS "neo4j-transaction-1","neo4j-transaction-2"
----

.Result
[role="queryresult",options="header,footer",cols="3*<m"]
|===
| +transactionId+ | +username+ | +message+

| +"neo4j-transaction-1"+ | +"neo4j"+ | +"Transaction terminated."+
| +"neo4j-transaction-2"+ | +null+ | +"Transaction not found."+

3+d|Rows: 2
|===

