[[query-union]]
= UNION
:description: The `UNION` clause is used to combine the result of multiple queries. 

* xref:clauses/union.adoc#union-introduction[Introduction]
* xref:clauses/union.adoc#union-combine-queries-retain-duplicates[Combine two queries and retain duplicates]
* xref:clauses/union.adoc#union-combine-queries-remove-duplicates[Combine two queries and remove duplicates]

[[union-introduction]]
== Introduction

`UNION` combines the results of two or more queries into a single result set that includes all the rows that belong to all queries in the union.

The number and the names of the columns must be identical in all queries combined by using `UNION`.

To keep all the result rows, use `UNION ALL`.
Using just `UNION` will combine and remove duplicates from the result set.

.Graph
["dot", "UNION-1.svg", "neoviz", ""]
----
  N0 [
    label = "{Actor|name = \'Anthony Hopkins\'\l}"
  ]
  N0 -> N3 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "ACTS_IN\n"
  ]
  N0 -> N1 [
    color = "#4e9a06"
    fontcolor = "#4e9a06"
    label = "KNOWS\n"
  ]
  N1 [
    label = "{Actor|name = \'Helen Mirren\'\l}"
  ]
  N1 -> N3 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "ACTS_IN\n"
  ]
  N2 [
    label = "{Actor|name = \'Hitchcock\'\l}"
  ]
  N3 [
    label = "{Movie|title = \'Hitchcock\'\l}"
  ]

----
 

[[union-combine-queries-retain-duplicates]]
== Combine two queries and retain duplicates

Combining the results from two queries is done using `UNION ALL`.


.Query
[source, cypher]
----
MATCH (n:Actor)
RETURN n.name AS name
UNION ALL
MATCH (n:Movie)
RETURN n.title AS name
----

The combined result is returned, including duplicates.

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===
| +name+
| +"Anthony Hopkins"+
| +"Helen Mirren"+
| +"Hitchcock"+
| +"Hitchcock"+
1+d|Rows: 4
|===

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
CREATE
  (ah:Actor {name: 'Anthony Hopkins'}),
  (hm:Actor {name: 'Helen Mirren'}),
  (hitchcock:Actor {name: 'Hitchcock'}),
  (hitchcockMovie:Movie {title: 'Hitchcock'}),
  (ah)-[:KNOWS]->(hm),
  (ah)-[:ACTS_IN]->(hitchcockMovie),
  (hm)-[:ACTS_IN]->(hitchcockMovie)

]]></database><command><![CDATA[
MATCH (n:Actor)
RETURN n.name AS name
UNION ALL
MATCH (n:Movie)
RETURN n.title AS name
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]

[[union-combine-queries-remove-duplicates]]
== Combine two queries and remove duplicates

By not including `ALL` in the `UNION`, duplicates are removed from the combined result set


.Query
[source, cypher]
----
MATCH (n:Actor)
RETURN n.name AS name
UNION
MATCH (n:Movie)
RETURN n.title AS name
----

The combined result is returned, without duplicates.

.Result
[role="queryresult",options="header,footer",cols="1*<m"]
|===
| +name+
| +"Anthony Hopkins"+
| +"Helen Mirren"+
| +"Hitchcock"+
1+d|Rows: 3
|===

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
CREATE
  (ah:Actor {name: 'Anthony Hopkins'}),
  (hm:Actor {name: 'Helen Mirren'}),
  (hitchcock:Actor {name: 'Hitchcock'}),
  (hitchcockMovie:Movie {title: 'Hitchcock'}),
  (ah)-[:KNOWS]->(hm),
  (ah)-[:ACTS_IN]->(hitchcockMovie),
  (hm)-[:ACTS_IN]->(hitchcockMovie)

]]></database><command><![CDATA[
MATCH (n:Actor)
RETURN n.name AS name
UNION
MATCH (n:Movie)
RETURN n.title AS name
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]

