:description: The query plans when indexes are used in various scenarios.

[[query-tuning-indexes]]
= The use of indexes

[abstract]
--
This section describes the query plans when indexes are used in various scenarios.
--

The task of tuning calls for different indexes depends on what the queries look like.
Therefore, it is important to have a fundamental understanding of how the indexes operate.
This section describes the query plans that result from different index scenarios.

Node indexes and relationship indexes operate in the same way.
Therefore, node and relationship indexes are used interchangeably in this section.

For instructions on how to create and maintain indexes, refer to xref::indexes-for-search-performance.adoc[].


== Index types and predicate compatibility

Generally, an index solves some combination of a label/relationship type predicate and property predicates at the same time.
There are different types of indexes available in Neo4j and these are compatible with different property predicates.

Indexes are most often used for `MATCH` and `OPTIONAL MATCH` clauses that combine a label/relationship type predicate with a property predicate.
Therefore, it is important to know what kind of predicates can be solved by the different indexes.

The different index types used for search performance are:

* `LOOKUP`
* `RANGE`
* `POINT`
* `TEXT`
* `BTREE` label:removed[]

[NOTE]
====
The `RANGE` and `TEXT` indexes can only perform limited matching on strings - exact, prefix, substring, or suffix matches.
A `FULLTEXT` index will instead tokenize the indexed string values, so it can match terms anywhere within the strings.
See xref::indexes-for-full-text-search.adoc[].
====


== LOOKUP indexes

`LOOKUP` indexes are present by default and solve only node label and relationship type predicates:

[cols="2, 2a", options="header"]
|===
| Predicate | Syntax (example)

| Node label predicate.
|
[source, syntax, role="noheader"]
----
MATCH (n:Label)
----

| Node label predicate.
|
[source, syntax, role="noheader"]
----
MATCH (n)
WHERE n:Label
----

| Relationship type predicate.
|
[source, syntax, role="noheader"]
----
MATCH ()-[r:REL]->()
----

| Relationship type predicate.
|
[source, syntax, role="noheader"]
----
MATCH ()-[r]->()
WHERE r:REL
----

|===

[WARNING]
====
`LOOKUP` indexes are the most important index type in the database because they improve the performance of the Cypher queries and the population of other indexes.
Dropping these indexes may lead to severe performance degradation.
Therefore, carefully consider the consequences before doing so.
====


== RANGE indexes

In combination with node label and relationship type predicates, `RANGE` indexes support most types of predicates:

[cols="2", options="header"]
|===

| Predicate | Syntax

| Equality check.
a|
[source, syntax, role="noheader"]
----
n.prop = value
----

| List membership check.
a|
[source, syntax, role="noheader"]
----
n.prop IN list
----

| Existence check.
a|
[source, syntax, role="noheader"]
----
n.prop IS NOT NULL
----

| Range search.
a|
[source, syntax, role="noheader"]
----
n.prop > value
----

| Prefix search.
a|
[source, syntax, role="noheader"]
----
STARTS WITH
----

|===


== POINT indexes

In combination with node label and relationship type predicates, `POINT` indexes only solve predicates operating on points.
Therefore, `POINT` indexes are only used when it is known that the predicate evaluates to `null` for all non-point values.

`POINT` indexes only support point type predicates:

[cols="2", options="header"]
|===
| Predicate | Syntax

| Property point value.
a|
[source, syntax, role="noheader"]
----
n.prop = point({x: value, y: value})
----

| Within bounding box.
a|
[source, syntax, role="noheader"]
----
point.withinBBox(n.prop, lowerLeftCorner, upperRightCorner)
----

| Distance.
a|
[source, syntax, role="noheader"]
----
point.distance(n.prop, center) < = distance
----

|===


== TEXT indexes

In combination with node label and relationship type predicates, `TEXT` indexes only solve predicates operating on strings.
That means that `TEXT` indexes are only used when it is known that the predicate evaluates to `null` for all non-string values.

Predicates that only operate on strings are always solvable by a `TEXT` index:

* `STARTS WITH`
* `ENDS WITH`
* `CONTAINS`

However, other predicates are only used when it is known that the property is compared to a string:

* `n.prop = "string"`
* `n.prop IN ["a", "b", "c"]`

This means that a `TEXT` index is not able to solve e.g. `a.prop = b.prop`.

In summary, `TEXT` indexes support the following predicates:

[cols="2", options="header"]
|===
| Predicate | Syntax

| Equality check.
a|
[source, syntax, role="noheader"]
----
n.prop = 'example_string'
----

| List membership check.
a|
[source, syntax, role="noheader"]
----
n.prop IN ['abc', 'example_string', 'neo4j']
----

| Prefix search.
a|
[source, syntax, role="noheader"]
----
STARTS WITH
----

| Suffix search.
a|
[source, syntax, role="noheader"]
----
ENDS WITH
----

| Substring search.
a|
[source, syntax, role="noheader"]
----
CONTAINS
----

|===

In some cases, the system cannot determine whether an expression is of type string.

For example when the compared value is a parameter:
[source, cypher, role="noheader"]
----
MATCH (n:Label) WHERE n.prop = $param
----

Such queries can be modified to provide this information.
Depending on how values that are not of type string should be treated, there are two options:

* If rows in which the expression is not of type string should be discarded, then adding `WHERE <expression> STARTS WITH ''` is the right option:
`MATCH (n:Label) WHERE $param STARTS WITH '' AND n.prop = $param`
* If expressions which are not of type string should be converted to string, then wrapping these in `toString(<expression>)` is the right choice:
`MATCH (n:Label) WHERE n.prop = toString($param)`


== Index preference

When multiple indexes are available and able to solve a predicate, there is an order defined that decides which index to use.

It is defined as such:

* `TEXT` indexes are used over `RANGE` and `POINT` indexes for `CONTAINS` and `ENDS WITH`.
* `POINT` indexes are used over `RANGE` and `TEXT` indexes for distance and within a bounding box.
* `RANGE` indexes are preferred over `TEXT` and `POINT` indexes in all other cases.

`LOOKUP` indexes are not defined in this order since they never solve the same set of predicates as the other indexes.

*Examples:*

* xref::query-tuning/indexes.adoc#administration-indexes-node-label-lookup-index-example[]
* xref::query-tuning/indexes.adoc#administration-indexes-relationship-type-lookup-index-example[]
* xref::query-tuning/indexes.adoc#administration-indexes-node-range-index-example[]
* xref::query-tuning/indexes.adoc#administration-indexes-relationship-range-index-example[]
* xref::query-tuning/indexes.adoc#administration-indexes-node-text-index-example[]
* xref::query-tuning/indexes.adoc#administration-indexes-relationship-text-index-example[]
* xref::query-tuning/indexes.adoc#administration-indexes-multiple-available-index-types[]
* xref::query-tuning/indexes.adoc#administration-indexes-equality-check-using-where-single-property-index[]
* xref::query-tuning/indexes.adoc#administration-indexes-equality-check-using-where-composite-index[]
* xref::query-tuning/indexes.adoc#administration-indexes-range-comparisons-using-where-single-property-index[]
* xref::query-tuning/indexes.adoc#administration-indexes-range-comparisons-using-where-composite-index[]
* xref::query-tuning/indexes.adoc#administration-indexes-multiple-range-comparisons-using-where-single-property-index[]
* xref::query-tuning/indexes.adoc#administration-indexes-multiple-range-comparisons-using-where-composite-index[]
* xref::query-tuning/indexes.adoc#administration-indexes-list-membership-check-using-in-single-property-index[]
* xref::query-tuning/indexes.adoc#administration-indexes-list-membership-check-using-in-composite-index[]
* xref::query-tuning/indexes.adoc#administration-indexes-prefix-search-using-starts-with-single-property-index[]
* xref::query-tuning/indexes.adoc#administration-indexes-prefix-search-using-starts-with-composite-index[]
* xref::query-tuning/indexes.adoc#administration-indexes-suffix-search-using-ends-with-single-property-index[]
* xref::query-tuning/indexes.adoc#administration-indexes-suffix-search-using-ends-with-composite-index[]
* xref::query-tuning/indexes.adoc#administration-indexes-substring-search-using-contains-single-property-index[]
* xref::query-tuning/indexes.adoc#administration-indexes-substring-search-using-contains-composite-index[]
* xref::query-tuning/indexes.adoc#administration-indexes-existence-check-using-is-not-null-single-property-index[]
* xref::query-tuning/indexes.adoc#administration-indexes-existence-check-using-is-not-null-composite-index[]
* xref::query-tuning/indexes.adoc#administration-indexes-spatial-distance-searches-single-property-index[]
* xref::query-tuning/indexes.adoc#administration-indexes-spatial-bounding-box-searches-single-property-index[]


[discrete]
[[administration-indexes-node-label-lookup-index-example]]
=== Node label LOOKUP index example

In the example below, a node `LOOKUP` index is available.

////
# neo4j has this by default, user don't need to run this
CREATE LOOKUP INDEX node_label_lookup_index FOR (n) ON EACH labels(n)
////

.Query
[source, cypher]
----
PROFILE
MATCH (person:Person)
RETURN person
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+------------------+---------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator         | Details       | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+------------------+---------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults  | person        |             42 |   42 |       0 |                |                        |           |                     |
| |                +---------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeByLabelScan | person:Person |             42 |   42 |      43 |            120 |                    2/1 |     0.565 | Fused in Pipeline 0 |
+------------------+---------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 43, total allocated memory: 184
----


[discrete]
[[administration-indexes-relationship-type-lookup-index-example]]
=== Relationship type LOOKUP index example

In the example below, a relationship `LOOKUP` index is available.

////
# neo4j has this by default, user don't need to run this
CREATE LOOKUP INDEX rel_type_lookup_index FOR ()-[r]-() ON EACH type(r)
////

.Query
[source, cypher]
----
PROFILE
MATCH ()-[r:KNOWS]->()
RETURN r
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+-------------------------------+------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator                      | Details                      | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+-------------------------------+------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults               | r                            |             22 |   22 |       0 |                |                        |           |                     |
| |                             +------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +DirectedRelationshipTypeScan | (anon_0)-[r:KNOWS]->(anon_1) |             22 |   22 |      23 |            120 |                    3/1 |     0.915 | Fused in Pipeline 0 |
+-------------------------------+------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 23, total allocated memory: 184
----


[discrete]
[[administration-indexes-node-range-index-example]]
=== Node RANGE index example

In the example below, a `Person(firstname)` node `RANGE` index is available.

////
[source, cypher, role=test-setup]
----
CREATE RANGE INDEX node_range_index_name FOR (n:Person) ON (n.firstname)
----
////

.Query
[source,cypher]
----
PROFILE
MATCH (person:Person {firstname: 'Andy'})
RETURN person
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+-----------------+----------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator        | Details                                                              | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+-----------------+----------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults | person                                                               |              1 |    1 |       0 |                |                        |           |                     |
| |               +----------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeIndexSeek  | RANGE INDEX person:Person(firstname) WHERE firstname = $autostring_0 |              1 |    1 |       2 |            120 |                    2/1 |     0.635 | Fused in Pipeline 0 |
+-----------------+----------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 2, total allocated memory: 184
----

[discrete]
[[administration-indexes-relationship-range-index-example]]
=== Relationship RANGE index example

In this example, a `KNOWS(since)` relationship `RANGE` index is available.

////
[source, cypher, role=test-setup]
----
CREATE RANGE INDEX rel_range_index_name FOR ()-[r:KNOWS]-() ON (r.since)
----
////

.Query
[source, cypher]
----
PROFILE
MATCH (person)-[relationship:KNOWS {since: 1992}]->(friend)
RETURN person, friend
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+--------------------------------+-------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator                       | Details                                                                             | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+--------------------------------+-------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults                | person, friend                                                                      |              1 |    1 |       0 |                |                        |           |                     |
| |                              +-------------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +DirectedRelationshipIndexSeek | RANGE INDEX (person)-[relationship:KNOWS(since)]->(friend) WHERE since = $autoint_0 |              1 |    1 |       2 |            120 |                    2/1 |     0.413 | Fused in Pipeline 0 |
+--------------------------------+-------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 2, total allocated memory: 184
----

[discrete]
[[administration-indexes-node-text-index-example]]
=== Node TEXT index

In the example below, a `Person(surname)` node `TEXT` index is available.

.Query
[source, cypher]
----
PROFILE
MATCH (person:Person {surname: 'Smith'})
RETURN person
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+------------------+----+--------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator         | Id | Details                        | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+------------------+----+--------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults  |  0 | person                         |              1 |    0 |       0 |                |                        |           |                     |
| |                +----+--------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter          |  1 | person.surname = $autostring_0 |              1 |    0 |       0 |                |                        |           |                     |
| |                +----+--------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeByLabelScan |  2 | person:Person                  |             10 |    0 |       1 |            120 |                    1/0 |     0.171 | Fused in Pipeline 0 |
+------------------+----+--------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 1, total allocated memory: 184
----


[discrete]
[[administration-indexes-relationship-text-index-example]]
=== Relationship TEXT index

In this example, a `KNOWS(lastMetLocation)` relationship `TEXT` index is available.

.Query
[source, cypher]
----
PROFILE
MATCH (person)-[relationship:KNOWS {metIn: 'Malmo'} ]->(friend)
RETURN person, friend
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+-------------------------------+----+-----------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator                      | Id | Details                                 | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+-------------------------------+----+-----------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults               |  0 | person, friend                          |              0 |    0 |       0 |                |                        |           |                     |
| |                             +----+-----------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter                       |  1 | relationship.metIn = $autostring_0      |              0 |    0 |       0 |                |                        |           |                     |
| |                             +----+-----------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +DirectedRelationshipTypeScan |  2 | (person)-[relationship:KNOWS]->(friend) |              3 |    0 |       1 |            120 |                    1/0 |     0.163 | Fused in Pipeline 0 |
+-------------------------------+----+-----------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 1, total allocated memory: 184
----


[discrete]
[[administration-indexes-multiple-available-index-types]]
=== Multiple available index types

In the example below, both a `Person(middlename)` node `TEXT` index and a `Person(middlename)` node `RANGE` index are available.
The `RANGE` node index is chosen.

.Query
[source, cypher]
----
PROFILE
MATCH (person:Person {middlename: 'Ron'})
RETURN person
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+------------------+----+-----------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator         | Id | Details                           | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+------------------+----+-----------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults  |  0 | person                            |              1 |    0 |       0 |                |                        |           |                     |
| |                +----+-----------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter          |  1 | person.middlename = $autostring_0 |              1 |    0 |       0 |                |                        |           |                     |
| |                +----+-----------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeByLabelScan |  2 | person:Person                     |             10 |    0 |       1 |            120 |                    1/0 |     0.169 | Fused in Pipeline 0 |
+------------------+----+-----------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 1, total allocated memory: 184
----


[discrete]
[[administration-indexes-equality-check-using-where-single-property-index]]
=== Equality check using `WHERE` (single-property index)

A query containing equality comparisons of a single indexed property in the `WHERE` clause is backed automatically by the index.
It is also possible for a query with multiple `OR` predicates to use multiple indexes, if indexes exist on the properties.
For example, if indexes exist on both `:Label(p1)` and `:Label(p2)`, `MATCH (n:Label) WHERE n.p1 = 1 OR n.p2 = 2 RETURN n` will use both indexes.


.Query
[source, query plan]
----
PROFILE
MATCH (person:Person)
WHERE person.firstname = 'Andy'
RETURN person
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+-----------------+----------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator        | Details                                                              | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+-----------------+----------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults | person                                                               |              1 |    1 |       0 |                |                        |           |                     |
| |               +----------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeIndexSeek  | RANGE INDEX person:Person(firstname) WHERE firstname = $autostring_0 |              1 |    1 |       2 |            120 |                    2/1 |     0.292 | Fused in Pipeline 0 |
+-----------------+----------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 2, total allocated memory: 184
----


[discrete]
[[administration-indexes-equality-check-using-where-composite-index]]
=== Equality check using `WHERE` (composite index)

A query containing equality comparisons for all the properties of a composite index will automatically be backed by the same index.
However, the query does not need to have equality on all properties.
It can have ranges and existence predicates as well.
But in these cases rewrites might happen depending on which properties have which predicates, see xref::indexes-for-search-performance.adoc#administration-indexes-single-vs-composite-index[composite index limitations].

////
[source, cypher, role="test-setup"]
----
CREATE (p0:`Person` {`age`:35, `country`:"UK", `firstname`:"John", `highScore`:54321, `middlename`:"Ron", `name`:"john", `surname`:"Smith"})
----
////

.Query
[source, cypher]
----
PROFILE
MATCH (n:Person)
WHERE n.age = 35 AND n.country = 'UK'
RETURN n
----

However, the query `MATCH (n:Person) WHERE n.age = 35 RETURN n` will not be backed by the composite index, as the query does not contain a predicate on the `country` property.
It will only be backed by an index on the `Person` label and `age` property defined thus: `:Person(age)`; i.e. a single-property index.

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version 5.3

Batch size 128

+------------------+----+--------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator         | Id | Details                                          | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+------------------+----+--------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults  |  0 | n                                                |              0 |    3 |      24 |                |                        |           |                     |
| |                +----+--------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter          |  1 | n.age = $autoint_0 AND n.country = $autostring_1 |              0 |    3 |      12 |                |                        |           |                     |
| |                +----+--------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeByLabelScan |  2 | n:Person                                         |             10 |    3 |       4 |            120 |                    3/0 |     0.345 | Fused in Pipeline 0 |
+------------------+----+--------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 40, total allocated memory: 184
----


[discrete]
[[administration-indexes-range-comparisons-using-where-single-property-index]]
=== Range comparisons using `WHERE` (single-property index)

Single-property indexes are also automatically used for inequality (range) comparisons of an indexed property in the `WHERE` clause.

.Query
[source, cypher]
----
PROFILE
MATCH (friend)<-[r:KNOWS]-(person)
WHERE r.since < 2011
RETURN friend, person
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+---------------------------------------+--------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator                              | Details                                                                  | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+---------------------------------------+--------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults                       | friend, person                                                           |              1 |    1 |       0 |                |                        |           |                     |
| |                                     +--------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +DirectedRelationshipIndexSeekByRange | RANGE INDEX (person)-[r:KNOWS(since)]->(friend) WHERE since < $autoint_0 |              1 |    1 |       2 |            120 |                    2/1 |     0.943 | Fused in Pipeline 0 |
+---------------------------------------+--------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 2, total allocated memory: 184
----


[discrete]
[[administration-indexes-range-comparisons-using-where-composite-index]]
=== Range comparisons using `WHERE` (composite index)

Composite indexes are also automatically used for inequality (range) comparisons of indexed properties in the `WHERE` clause.
Equality or list membership check predicates may precede the range predicate.
However, predicates after the range predicate may be rewritten as an existence check predicate and a filter as described in xref::indexes-for-search-performance.adoc#administration-indexes-single-vs-composite-index[composite index limitations].

// nor sure about the query plan for this one, we got two query here
.Query
[source, cypher]
----
PROFILE
MATCH (n:Person)
WHERE n.age = 35 AND n.country = 'UK'
RETURN n;
PROFILE
MATCH ()-[r:KNOWS]-()
WHERE r.since < 2011 AND r.lastMet > 2019
RETURN r.since
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+-----------------------------------------+----+-----------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator                                | Id | Details                                                                                 | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+-----------------------------------------+----+-----------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults                         |  0 | `r.since`                                                                               |              0 |    0 |       0 |                |                        |           |                     |
| |                                       +----+-----------------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Projection                             |  1 | cache[r.since] AS `r.since`                                                             |              0 |    0 |       0 |                |                        |           |                     |
| |                                       +----+-----------------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter                                 |  2 | r.lastMet > $autoint_1                                                                  |              0 |    0 |       0 |                |                        |           |                     |
| |                                       +----+-----------------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +UndirectedRelationshipIndexSeekByRange |  3 | RANGE INDEX (anon_0)-[r:KNOWS(since)]-(anon_1) WHERE since < $autoint_0, cache[r.since] |              0 |    0 |       1 |            120 |                    1/0 |     0.274 | Fused in Pipeline 0 |
+-----------------------------------------+----+-----------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 2, total allocated memory: 184
----


[discrete]
[[administration-indexes-multiple-range-comparisons-using-where-single-property-index]]
=== Multiple range comparisons using `WHERE` (single-property index)

When the `WHERE` clause contains multiple inequality (range) comparisons for the same property, these can be combined in a single index range seek.

.Query
[source, cypher]
----
PROFILE
MATCH (person:Person)
WHERE 10000 < person.highScore < 20000
RETURN person
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+------------------+----+-------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator         | Id | Details                                                                       | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+------------------+----+-------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults  |  0 | person                                                                        |              2 |    0 |       0 |                |                        |           |                     |
| |                +----+-------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter          |  1 | cache[person.highScore] > $autoint_0 AND cache[person.highScore] < $autoint_1 |              2 |    0 |       6 |                |                        |           |                     |
| |                +----+-------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeByLabelScan |  2 | person:Person                                                                 |             10 |    3 |       4 |            120 |                    3/0 |     0.263 | Fused in Pipeline 0 |
+------------------+----+-------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 10, total allocated memory: 184
----


[discrete]
[[administration-indexes-multiple-range-comparisons-using-where-composite-index]]
=== Multiple range comparisons using `WHERE` (composite index)

When the `WHERE` clause contains multiple inequality (range) comparisons for the same property, these can be combined in a single index range seek.
That single range seek created in the following query will then use the composite index `Person(highScore, name)` if it exists.

////
[source, cypher, role=test-setup]
----
CREATE INDEX
FOR (p:Person) ON (p.highScore, p.name);
CREATE (:Person)
----
////

.Query
[source, cypher]
----
PROFILE
MATCH (person:Person)
WHERE 10000 < person.highScore < 20000 AND person.name IS NOT NULL
RETURN person
----


.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+-----------------+------------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator        | Details                                                                                              | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+-----------------+------------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults | person                                                                                               |              1 |    1 |       0 |                |                        |           |                     |
| |               +------------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeIndexSeek  | RANGE INDEX person:Person(highScore, name) WHERE highScore > $autoint_0 AND highScore < $autoint_1 A |              1 |    1 |       2 |            120 |                    2/1 |     4.498 | Fused in Pipeline 0 |
|                 | ND name IS NOT NULL                                                                                  |                |      |         |                |                        |           |                     |
+-----------------+------------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 2, total allocated memory: 184
----


[discrete]
[[administration-indexes-list-membership-check-using-in-single-property-index]]
=== List membership check using `IN` (single-property index)

The `IN` predicate on `r.since` in the following query will use the single-property index `KNOWS(lastMetIn)` if it exists.

.Query
[source, cypher]
----
PROFILE
MATCH (person)-[r:KNOWS]->(friend)
WHERE r.lastMetIn IN ['Malmo', 'Stockholm']
RETURN person, friend
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+-------------------------------+----+------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator                      | Id | Details                      | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+-------------------------------+----+------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults               |  0 | person, friend               |              1 |    0 |       0 |                |                        |           |                     |
| |                             +----+------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter                       |  1 | r.lastMetIn IN $autolist_0   |              1 |    0 |       0 |              0 |                        |           |                     |
| |                             +----+------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +DirectedRelationshipTypeScan |  2 | (person)-[r:KNOWS]->(friend) |              3 |    0 |       1 |            120 |                    1/0 |     0.212 | Fused in Pipeline 0 |
+-------------------------------+----+------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 1, total allocated memory: 184
----


[discrete]
[[administration-indexes-list-membership-check-using-in-composite-index]]
=== List membership check using `IN` (composite index)

The `IN` predicates on `r.since` and `r.lastMet` in the following query will use the composite index `KNOWS(since, lastMet)` if it exists.

.Query
[source, cypher]
----
PROFILE
MATCH (person)-[r:KNOWS]->(friend)
WHERE r.since IN [1992, 2017] AND r.lastMet IN [2002, 2021]
RETURN person, friend
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+--------------------------------+----+----------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator                       | Id | Details                                                                    | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+--------------------------------+----+----------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults                |  0 | person, friend                                                             |              0 |    0 |       0 |                |                        |           |                     |
| |                              +----+----------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter                        |  1 | r.lastMet IN $autolist_1                                                   |              0 |    0 |       0 |              0 |                        |           |                     |
| |                              +----+----------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +DirectedRelationshipIndexSeek |  2 | RANGE INDEX (person)-[r:KNOWS(since)]->(friend) WHERE since IN $autolist_0 |              0 |    0 |       2 |            120 |                    2/0 |     0.267 | Fused in Pipeline 0 |
+--------------------------------+----+----------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 2, total allocated memory: 184
----


[discrete]
[[administration-indexes-prefix-search-using-starts-with-single-property-index]]
=== Prefix search using `STARTS WITH` (single-property index)

The `STARTS WITH` predicate on `person.firstname` in the following query will use the `Person(firstname)` index, if it exists.

.Query
[source, cypher]
----
PROFILE
MATCH (person:Person)
WHERE person.firstname STARTS WITH 'And'
RETURN person
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+-----------------------+--------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator              | Details                                                                        | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+-----------------------+--------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults       | person                                                                         |              2 |    1 |       0 |                |                        |           |                     |
| |                     +--------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeIndexSeekByRange | RANGE INDEX person:Person(firstname) WHERE firstname STARTS WITH $autostring_0 |              2 |    1 |       2 |            120 |                    3/0 |     0.387 | Fused in Pipeline 0 |
+-----------------------+--------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 2, total allocated memory: 184
----


[discrete]
[[administration-indexes-prefix-search-using-starts-with-composite-index]]
=== Prefix search using `STARTS WITH` (composite index)

The `STARTS WITH` predicate on `person.firstname` in the following query will use the `Person(firstname,surname)` index, if it exists.
Any (non-existence check) predicate on `person.surname` will be rewritten as existence check with a filter.
However, if the predicate on `person.firstname` is a equality check then a `STARTS WITH` on `person.surname` would also use the index (without rewrites).
More information about how the rewriting works can be found in xref::indexes-for-search-performance.adoc#administration-indexes-single-vs-composite-index[composite index limitations].

.Query
[source, cypher]
----
PROFILE
MATCH (person:Person)
WHERE person.firstname STARTS WITH 'And' AND person.surname IS NOT NULL
RETURN person
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+-----------------------+----+--------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator              | Id | Details                                                                        | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+-----------------------+----+--------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults       |  0 | person                                                                         |              0 |    0 |       0 |                |                        |           |                     |
| |                     +----+--------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter               |  1 | person.surname IS NOT NULL                                                     |              0 |    0 |       0 |                |                        |           |                     |
| |                     +----+--------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeIndexSeekByRange |  2 | RANGE INDEX person:Person(firstname) WHERE firstname STARTS WITH $autostring_0 |              0 |    0 |       1 |            120 |                    1/0 |     0.277 | Fused in Pipeline 0 |
+-----------------------+----+--------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 1, total allocated memory: 184
----


[discrete]
[[administration-indexes-suffix-search-using-ends-with-single-property-index]]
=== Suffix search using `ENDS WITH` (single-property index)

The `ENDS WITH` predicate on `r.metIn` in the following query uses the `KNOWS(metIn)` index, if it exists.
Text indexes are optimized for `CONTAINS` and `ENDS WITH` and they are the only indexes that can solve those predicates.

////
[source, cypher, role=test-setup]
----
CREATE TEXT INDEX FOR ()-[r:KNOWS]-() ON (r.metIn)
----
////

.Query
[source, cypher]
----
PROFILE
MATCH (person)-[r:KNOWS]->(friend)
WHERE r.metIn ENDS WITH 'mo'
RETURN person, friend
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version 5.3

Batch size 128

+----------------------------------------+----+------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator                               | Id | Details                                                                            | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+----------------------------------------+----+------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults                        |  0 | person, friend                                                                     |              0 |    0 |       0 |                |                        |           |                     |
| |                                      +----+------------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +DirectedRelationshipIndexEndsWithScan |  1 | TEXT INDEX (person)-[r:KNOWS(metIn)]->(friend) WHERE metIn ENDS WITH $autostring_0 |              0 |    0 |       1 |            120 |                    0/0 |     1.624 | Fused in Pipeline 0 |
+----------------------------------------+----+------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 1, total allocated memory: 184
----


Text indexes only index String values and therefore do not find other values.


[discrete]
[[administration-indexes-suffix-search-using-ends-with-composite-index]]
=== Suffix search using `ENDS WITH` (composite index)

The `ENDS WITH` predicate on `r.metIn` in the following query uses the `KNOWS(metIn, lastMetIn)` index, if it exists.
However, it is rewritten as existence check and a filter due to the index not supporting actual suffix searches for composite indexes, this is still faster than not using an index in the first place.
Any (non-existence check) predicate on `KNOWS.lastMetIn` is also rewritten as existence check with a filter.
More information about how the rewriting works can be found in xref::indexes-for-search-performance.adoc#administration-indexes-single-vs-composite-index[composite index limitations].

.Query
[source, cypher]
----
PROFILE
MATCH (person)-[r:KNOWS]->(friend)
WHERE r.metIn ENDS WITH 'mo' AND r.lastMetIn IS NOT NULL
RETURN person, friend
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+----------------------------------------+----+------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator                               | Id | Details                                                                            | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+----------------------------------------+----+------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults                        |  0 | person, friend                                                                     |              0 |    0 |       0 |                |                        |           |                     |
| |                                      +----+------------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter                                |  1 | r.lastMetIn IS NOT NULL                                                            |              0 |    0 |       0 |                |                        |           |                     |
| |                                      +----+------------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +DirectedRelationshipIndexEndsWithScan |  2 | TEXT INDEX (person)-[r:KNOWS(metIn)]->(friend) WHERE metIn ENDS WITH $autostring_0 |              0 |    0 |       1 |            120 |                    0/0 |     1.434 | Fused in Pipeline 0 |
+----------------------------------------+----+------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 1, total allocated memory: 184
----


[discrete]
[[administration-indexes-substring-search-using-contains-single-property-index]]
=== Substring search using `CONTAINS` (single-property index)

The `CONTAINS` predicate on `person.firstname` in the following query will use the `Person(firstname)` index, if it exists.
Text indexes are optimized for `CONTAINS` and `ENDS WITH` and they are the only indexes that can solve those predicates.
Composite indexes are currently not able to support `CONTAINS`.

.Query
[source, cypher]
----
PROFILE
MATCH (person:Person)
WHERE person.firstname CONTAINS 'h'
RETURN person
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version 5.3

Batch size 128

+-----------------+----+-------------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator        | Id | Details                                                                                   | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+-----------------+----+-------------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults |  0 | person                                                                                    |              0 |    2 |      16 |                |                        |           |                     |
| |               +----+-------------------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter         |  1 | cache[person.firstname] CONTAINS $autostring_0                                            |              0 |    2 |       0 |                |                        |           |                     |
| |               +----+-------------------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeIndexScan  |  2 | RANGE INDEX person:Person(firstname) WHERE firstname IS NOT NULL, cache[person.firstname] |              1 |    2 |       3 |            120 |                    3/0 |     0.403 | Fused in Pipeline 0 |
+-----------------+----+-------------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 19, total allocated memory: 184
----


Text indexes only index String values and therefore do not find other values.


[discrete]
[[administration-indexes-substring-search-using-contains-composite-index]]
=== Substring search using `CONTAINS` (composite index)

The `CONTAINS` predicate on `person.country` in the following query will use the `Person(country,age)` index, if it exists.
However, it will be rewritten as existence check and a filter due to the index not supporting actual suffix searches for composite indexes, this is still faster than not using an index in the first place.
Any (non-existence check) predicate on `person.age` will also be rewritten as existence check with a filter.
More information about how the rewriting works can be found in xref::indexes-for-search-performance.adoc#administration-indexes-single-vs-composite-index[composite index limitations].

.Query
[source, cypher]
----
PROFILE
MATCH (person:Person)
WHERE person.country CONTAINS '300' AND person.age IS NOT NULL
RETURN person
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+------------------+----+------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator         | Id | Details                                                          | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+------------------+----+------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults  |  0 | person                                                           |              0 |    0 |       0 |                |                        |           |                     |
| |                +----+------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter          |  1 | person.country CONTAINS $autostring_0 AND person.age IS NOT NULL |              0 |    0 |       8 |                |                        |           |                     |
| |                +----+------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeByLabelScan |  2 | person:Person                                                    |             10 |    4 |       5 |            120 |                    3/0 |     0.296 | Fused in Pipeline 0 |
+------------------+----+------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 13, total allocated memory: 184
----


[discrete]
[[administration-indexes-existence-check-using-is-not-null-single-property-index]]
=== Existence check using `IS NOT NULL` (single-property index)

The `r.since IS NOT NULL` predicate in the following query uses the `KNOWS(since)` index, if it exists.

.Query
[source, cypher]
----
PROFILE
MATCH (person)-[r:KNOWS]->(friend)
WHERE r.since IS NOT NULL
RETURN person, friend
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+--------------------------------+-------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator                       | Details                                                                 | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+--------------------------------+-------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults                | person, friend                                                          |              1 |    1 |       0 |                |                        |           |                     |
| |                              +-------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +DirectedRelationshipIndexScan | RANGE INDEX (person)-[r:KNOWS(since)]->(friend) WHERE since IS NOT NULL |              1 |    1 |       2 |            120 |                    2/1 |     1.046 | Fused in Pipeline 0 |
+--------------------------------+-------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 2, total allocated memory: 184
----


[discrete]
[[administration-indexes-existence-check-using-is-not-null-composite-index]]
=== Existence check using `IS NOT NULL` (composite index)

The `p.firstname IS NOT NULL` and `p.surname IS NOT NULL` predicates in the following query will use the `Person(firstname,surname)` index, if it exists.
Any (non-existence check) predicate on `person.surname` will be rewritten as existence check with a filter.

.Query
[source, cypher]
----
PROFILE
MATCH (p:Person)
WHERE p.firstname IS NOT NULL AND p.surname IS NOT NULL
RETURN p
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+-----------------+----+-------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator        | Id | Details                                                     | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+-----------------+----+-------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults |  0 | p                                                           |              1 |    3 |      24 |                |                        |           |                     |
| |               +----+-------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter         |  1 | p.surname IS NOT NULL                                       |              1 |    3 |       6 |                |                        |           |                     |
| |               +----+-------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeIndexScan  |  2 | RANGE INDEX p:Person(firstname) WHERE firstname IS NOT NULL |              1 |    3 |       4 |            120 |                    3/0 |     0.413 | Fused in Pipeline 0 |
+-----------------+----+-------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 34, total allocated memory: 184
----


[discrete]
[[administration-indexes-spatial-distance-searches-single-property-index]]
=== Spatial distance searches (single-property index)

////
[source, cypher, role=test-setup]
----
CREATE POINT INDEX
FOR ()-[r:KNOWS]-() ON (r.lastMetPoint)
----
////

If a property with point values is indexed, the index is used for spatial distance searches as well as for range queries.

.Query
[source, cypher]
----
PROFILE
MATCH ()-[r:KNOWS]->()
WHERE point.distance(r.lastMetPoint, point({x: 1, y: 2})) < 2
RETURN r.lastMetPoint
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+---------------------------------------+------------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator                              | Details                                                                                              | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+---------------------------------------+------------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults                       | `r.lastMetPoint`                                                                                     |             13 |    9 |       0 |                |                        |           |                     |
| |                                     +------------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Projection                           | cache[r.lastMetPoint] AS `r.lastMetPoint`                                                            |             13 |    9 |       0 |                |                        |           |                     |
| |                                     +------------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter                               | point.distance(cache[r.lastMetPoint], point({x: $autoint_0, y: $autoint_1})) < $autoint_2            |             13 |    9 |       0 |                |                        |           |                     |
| |                                     +------------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +DirectedRelationshipIndexSeekByRange | POINT INDEX (anon_0)-[r:KNOWS(lastMetPoint)]->(anon_1) WHERE point.distance(lastMetPoint, point($aut |             13 |    9 |      10 |            120 |                    5/3 |     1.417 | Fused in Pipeline 0 |
|                                       | oint_0, $autoint_1)) < $autoint_2, cache[r.lastMetPoint]                                             |                |      |         |                |                        |           |                     |
+---------------------------------------+------------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 10, total allocated memory: 184
----


[discrete]
[[administration-indexes-spatial-bounding-box-searches-single-property-index]]
=== Spatial bounding box searches (single-property index)

The ability to do index seeks on bounded ranges works even with the 2D and 3D spatial `Point` types.


.Query
[source, cypher]
----
PROFILE
MATCH (person:Person)
WHERE point.withinBBox(person.location, point({x: 1.2, y: 5.4}), point({x: 1.3, y: 5.5}))
RETURN person.firstname
----

.Query Plan
[role="queryplan"]
----
Planner COST

Runtime PIPELINED

Runtime version {neo4j-version-minor}

Batch size 128

+------------------+----+------------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| Operator         | Id | Details                                                                                              | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Page Cache Hits/Misses | Time (ms) | Pipeline            |
+------------------+----+------------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+
| +ProduceResults  |  0 | `person.firstname`                                                                                   |              0 |    0 |       0 |                |                        |           |                     |
| |                +----+------------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Projection      |  1 | person.firstname AS `person.firstname`                                                               |              0 |    0 |       0 |                |                        |           |                     |
| |                +----+------------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +Filter          |  2 | point.withinBBox(person.location, point({x: $autodouble_0, y: $autodouble_1}), point({x: $autodouble |              0 |    0 |       0 |                |                        |           |                     |
| |                |    | _2, y: $autodouble_3}))                                                                              |                |      |         |                |                        |           |                     |
| |                +----+------------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+                        |           |                     |
| +NodeByLabelScan |  3 | person:Person                                                                                        |             10 |    4 |       5 |            120 |                    1/0 |     0.342 | Fused in Pipeline 0 |
+------------------+----+------------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+------------------------+-----------+---------------------+

Total database accesses: 5, total allocated memory: 184
----

