[[query-using]]
= Planner hints and the USING keyword
:description: A planner hint is used to influence the decisions of the planner when building an execution plan for a query. Planner hints are specified in a query with the `USING` keyword. 

[CAUTION]
====
Forcing planner behavior is an advanced feature, and should be used with caution by experienced developers and/or database administrators only, as it may cause queries to perform poorly.


====

* xref:query-tuning/using.adoc#query-using-introduction[Introduction]
* xref:query-tuning/using.adoc#query-using-index-hint[Index hints]
* xref:query-tuning/using.adoc#query-using-scan-hint[Scan hints]
* xref:query-tuning/using.adoc#query-using-join-hint[Join hints]
* xref:query-tuning/using.adoc#query-using-periodic-commit-hint[`PERIODIC COMMIT` query hint]

[[query-using-introduction]]
== Introduction

When executing a query, Neo4j needs to decide where in the query graph to start matching.
This is done by looking at the `MATCH` clause and the `WHERE` conditions and using that information to find useful indexes, or other starting points.

However, the selected index might not always be the best choice.
Sometimes multiple indexes are possible candidates, and the query planner picks the suboptimal one from a performance point of view.
Moreover, in some circumstances (albeit rarely) it is better not to use an index at all.

Neo4j can be forced to use a specific starting point through the `USING` keyword. This is called giving a planner hint.
There are four types of planner hints: index hints, scan hints, join hints, and the `PERIODIC COMMIT` query hint.

The following graph is used for the examples below:

.Graph
["dot", "Planner hints and the USING keyword-1.svg", "neoviz", ""]
----
  N0 [
    label = "{Scientist|name = \'Liskov\'\lborn = 1939\l}"
  ]
  N0 -> N2 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "RESEARCHED\n"
  ]
  N0 -> N1 [
    color = "#4e9a06"
    fontcolor = "#4e9a06"
    label = "KNOWS\n"
  ]
  N1 [
    label = "{Scientist|name = \'Wing\'\lborn = 1956\l}"
  ]
  N1 -> N4 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "RESEARCHED\n"
  ]
  N1 -> N2 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "RESEARCHED\n"
  ]
  N2 [
    label = "{Science|name = \'Computer Science\'\l}"
  ]
  N3 [
    label = "{Scientist|name = \'Conway\'\lborn = 1938\l}"
  ]
  N3 -> N2 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "RESEARCHED\n"
  ]
  N4 [
    label = "{Science|name = \'Engineering\'\l}"
  ]
  N5 [
    label = "{Science|name = \'Chemistry\'\l}"
  ]
  N6 [
    label = "{Scientist|name = \'Curie\'\lborn = 1867\l}"
  ]
  N6 -> N5 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "RESEARCHED\n"
  ]
  N7 [
    label = "{Scientist|name = \'Arden\'\l}"
  ]
  N7 -> N5 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "RESEARCHED\n"
  ]
  N8 [
    label = "{Scientist|name = \'Franklin\'\l}"
  ]
  N8 -> N5 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "RESEARCHED\n"
  ]
  N9 [
    label = "{Scientist|name = \'Harrison\'\l}"
  ]
  N9 -> N5 [
    color = "#2e3436"
    fontcolor = "#2e3436"
    label = "RESEARCHED\n"
  ]

----
 


.Query
[source, cypher]
----
MATCH (liskov:Scientist {name:'Liskov'})-[:KNOWS]->(wing:Scientist)-[:RESEARCHED]->(cs:Science {name:'Computer Science'})<-[:RESEARCHED]-(conway:Scientist {name: 'Conway'}) RETURN 1 AS column
----

The following query will be used in some of the examples on this page. It has intentionally been constructed in
such a way that the statistical information will be inaccurate for the particular path that this query
matches. For this reason, it can be improved by supplying planner hints.

.Query plan
[source]
----
Compiler CYPHER 4.1

Planner COST

Runtime PIPELINED

Runtime version 4.1

+-------------------------+------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| Operator                | Details                                                                                        | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Time (ms) | Order           | Other               |
+-------------------------+------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +ProduceResults         | column                                                                                         |              0 |    1 |       0 |                |     0.057 | cs.name ASC     | In Pipeline 5       |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +Projection             | $autoint_3 AS column                                                                           |              0 |    1 |       0 |                |     0.048 | cs.name ASC     | In Pipeline 5       |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +NodeHashJoin           | wing                                                                                           |              0 |    1 |       0 |            608 |     0.070 | cs.name ASC     | In Pipeline 5       |
| |\                      +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +Filter               | not anon_122 = anon_68                                                                         |              0 |    2 |       0 |                |     0.058 | cs.name ASC     | In Pipeline 4       |
| | |                     +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +NodeHashJoin         | cs                                                                                             |              0 |    3 |       0 |            720 |     0.877 | cs.name ASC     | In Pipeline 4       |
| | |\                    +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | | +Expand(Into)       | (cs)<-[anon_122:RESEARCHED]-(conway)                                                           |              0 |    1 |       5 |            952 |     0.213 | cs.name ASC     | In Pipeline 3       |
| | | |                   +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | | +MultiNodeIndexSeek | cs:Science(name) WHERE name = $autostring_1, conway:Scientist(name) WHERE name = $autostring_2 |              0 |    1 |       4 |             64 |     0.168 | cs.name ASC     | In Pipeline 2       |
| | |                     +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +Filter               | wing:Scientist                                                                                 |              0 |    3 |       3 |                |           | cs.name ASC     | Fused in Pipeline 1 |
| | |                     +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +Expand(All)          | (cs)<-[anon_68:RESEARCHED]-(wing)                                                              |              0 |    3 |       4 |                |           | cs.name ASC     | Fused in Pipeline 1 |
| | |                     +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +NodeIndexSeek        | cs:Science(name) WHERE name = $autostring_1                                                    |              0 |    1 |       2 |             64 |           | cs.name ASC     | Fused in Pipeline 1 |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +Filter                 | wing:Scientist                                                                                 |              0 |    1 |       1 |                |           | liskov.name ASC | Fused in Pipeline 0 |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +Expand(All)            | (liskov)-[anon_41:KNOWS]->(wing)                                                               |              0 |    1 |       3 |                |           | liskov.name ASC | Fused in Pipeline 0 |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +NodeIndexSeek          | liskov:Scientist(name) WHERE name = $autostring_0                                              |              0 |    1 |       2 |             64 |           | liskov.name ASC | Fused in Pipeline 0 |
+-------------------------+------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+

Total database accesses: 24, total allocated memory: 2064

----

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
CREATE INDEX FOR (n:Scientist) ON (n.name)
CREATE INDEX FOR (n:Science) ON (n.name)
CALL db.awaitIndexes
CREATE
(liskov:Scientist {name: 'Liskov', born: 1939})-[:KNOWS]->(wing:Scientist {name: 'Wing', born: 1956})-[:RESEARCHED]->(cs:Science {name: 'Computer Science'})<-[:RESEARCHED]-(conway:Scientist {name: 'Conway', born: 1938}),
(liskov)-[:RESEARCHED]->(cs),
(wing)-[:RESEARCHED]->(:Science {name: 'Engineering'}),
(chemistry:Science {name: 'Chemistry'})<-[:RESEARCHED]-(:Scientist {name: 'Curie', born: 1867}),
(chemistry)<-[:RESEARCHED]-(:Scientist {name: 'Arden'}),
(chemistry)<-[:RESEARCHED]-(:Scientist {name: 'Franklin'}),
(chemistry)<-[:RESEARCHED]-(:Scientist {name: 'Harrison'})
      

]]></database><command><![CDATA[
MATCH (liskov:Scientist {name:'Liskov'})-[:KNOWS]->(wing:Scientist)-[:RESEARCHED]->(cs:Science {name:'Computer Science'})<-[:RESEARCHED]-(conway:Scientist {name: 'Conway'}) RETURN 1 AS column
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]

[[query-using-index-hint]]
== Index hints

Index hints are used to specify which index, if any, the planner should use as a starting point.
This can be beneficial in cases where the index statistics are not accurate for the specific values that
the query at hand is known to use, which would result in the planner picking a non-optimal index.
To supply an index hint, use `USING INDEX variable:Label(property)` or `USING INDEX SEEK variable:Label(property)` after the applicable `MATCH` clause.

It is possible to supply several index hints, but keep in mind that several starting points
will require the use of a potentially expensive join later in the query plan.

=== Query using an index hint

The query above will not naturally pick an index to solve the plan.
This is because the graph is very small, and label scans are faster for small databases.
In general, however, query performance is ranked by the dbhit metric, and we see that using an index is
slightly better for this query.


.Query
[source, cypher]
----
MATCH (liskov:Scientist {name:'Liskov'})-[:KNOWS]->(wing:Scientist)-[:RESEARCHED]->(cs:Science {name:'Computer Science'})<-[:RESEARCHED]-(conway:Scientist {name: 'Conway'}) USING INDEX liskov:Scientist(name) RETURN liskov.born AS column
----

Returns the year *'Barbara Liskov'* was born.

.Query plan
[source]
----
Compiler CYPHER 4.1

Planner COST

Runtime PIPELINED

Runtime version 4.1

+-------------------------+------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| Operator                | Details                                                                                        | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Time (ms) | Order           | Other               |
+-------------------------+------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +ProduceResults         | column                                                                                         |              0 |    1 |       0 |                |     0.055 | cs.name ASC     | In Pipeline 5       |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +Projection             | liskov.born AS column                                                                          |              0 |    1 |       3 |                |     0.048 | cs.name ASC     | In Pipeline 5       |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +NodeHashJoin           | wing                                                                                           |              0 |    1 |       0 |            608 |     0.075 | cs.name ASC     | In Pipeline 5       |
| |\                      +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +Filter               | not anon_122 = anon_68                                                                         |              0 |    2 |       0 |                |     0.045 | cs.name ASC     | In Pipeline 4       |
| | |                     +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +NodeHashJoin         | cs                                                                                             |              0 |    3 |       0 |            720 |     0.070 | cs.name ASC     | In Pipeline 4       |
| | |\                    +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | | +Expand(Into)       | (cs)<-[anon_122:RESEARCHED]-(conway)                                                           |              0 |    1 |       5 |            952 |     0.096 | cs.name ASC     | In Pipeline 3       |
| | | |                   +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | | +MultiNodeIndexSeek | cs:Science(name) WHERE name = $autostring_1, conway:Scientist(name) WHERE name = $autostring_2 |              0 |    1 |       4 |             64 |     0.148 | cs.name ASC     | In Pipeline 2       |
| | |                     +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +Filter               | wing:Scientist                                                                                 |              0 |    3 |       3 |                |           | cs.name ASC     | Fused in Pipeline 1 |
| | |                     +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +Expand(All)          | (cs)<-[anon_68:RESEARCHED]-(wing)                                                              |              0 |    3 |       4 |                |           | cs.name ASC     | Fused in Pipeline 1 |
| | |                     +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +NodeIndexSeek        | cs:Science(name) WHERE name = $autostring_1                                                    |              0 |    1 |       2 |             64 |           | cs.name ASC     | Fused in Pipeline 1 |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +Filter                 | wing:Scientist                                                                                 |              0 |    1 |       1 |                |           | liskov.name ASC | Fused in Pipeline 0 |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +Expand(All)            | (liskov)-[anon_41:KNOWS]->(wing)                                                               |              0 |    1 |       3 |                |           | liskov.name ASC | Fused in Pipeline 0 |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +NodeIndexSeek          | liskov:Scientist(name) WHERE name = $autostring_0                                              |              0 |    1 |       2 |             64 |           | liskov.name ASC | Fused in Pipeline 0 |
+-------------------------+------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+

Total database accesses: 27, total allocated memory: 2064

----

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
CREATE INDEX FOR (n:Scientist) ON (n.name)
CREATE INDEX FOR (n:Science) ON (n.name)
CALL db.awaitIndexes
CREATE
(liskov:Scientist {name: 'Liskov', born: 1939})-[:KNOWS]->(wing:Scientist {name: 'Wing', born: 1956})-[:RESEARCHED]->(cs:Science {name: 'Computer Science'})<-[:RESEARCHED]-(conway:Scientist {name: 'Conway', born: 1938}),
(liskov)-[:RESEARCHED]->(cs),
(wing)-[:RESEARCHED]->(:Science {name: 'Engineering'}),
(chemistry:Science {name: 'Chemistry'})<-[:RESEARCHED]-(:Scientist {name: 'Curie', born: 1867}),
(chemistry)<-[:RESEARCHED]-(:Scientist {name: 'Arden'}),
(chemistry)<-[:RESEARCHED]-(:Scientist {name: 'Franklin'}),
(chemistry)<-[:RESEARCHED]-(:Scientist {name: 'Harrison'})
      

]]></database><command><![CDATA[
MATCH (liskov:Scientist {name:'Liskov'})-[:KNOWS]->(wing:Scientist)-[:RESEARCHED]->(cs:Science {name:'Computer Science'})<-[:RESEARCHED]-(conway:Scientist {name: 'Conway'}) USING INDEX liskov:Scientist(name) RETURN liskov.born AS column
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]

=== Query using an index seek hint

Similar to the index (scan) hint, but an index seek will be used rather than an index scan.
Index seeks require no post filtering, they are most efficient when a relatively small number of nodes have the specified value on the queried property.


.Query
[source, cypher]
----
MATCH (liskov:Scientist {name:'Liskov'})-[:KNOWS]->(wing:Scientist)-[:RESEARCHED]->(cs:Science {name:'Computer Science'})<-[:RESEARCHED]-(conway:Scientist {name: 'Conway'}) USING INDEX SEEK liskov:Scientist(name) RETURN liskov.born AS column
----

Returns the year *'Barbara Liskov'* was born.

.Query plan
[source]
----
Compiler CYPHER 4.1

Planner COST

Runtime PIPELINED

Runtime version 4.1

+-------------------------+------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| Operator                | Details                                                                                        | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Time (ms) | Order           | Other               |
+-------------------------+------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +ProduceResults         | column                                                                                         |              0 |    1 |       0 |                |     0.054 | cs.name ASC     | In Pipeline 5       |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +Projection             | liskov.born AS column                                                                          |              0 |    1 |       3 |                |     0.040 | cs.name ASC     | In Pipeline 5       |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +NodeHashJoin           | wing                                                                                           |              0 |    1 |       0 |            608 |     0.066 | cs.name ASC     | In Pipeline 5       |
| |\                      +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +Filter               | not anon_122 = anon_68                                                                         |              0 |    2 |       0 |                |     0.042 | cs.name ASC     | In Pipeline 4       |
| | |                     +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +NodeHashJoin         | cs                                                                                             |              0 |    3 |       0 |            720 |     0.067 | cs.name ASC     | In Pipeline 4       |
| | |\                    +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | | +Expand(Into)       | (cs)<-[anon_122:RESEARCHED]-(conway)                                                           |              0 |    1 |       5 |            952 |     0.095 | cs.name ASC     | In Pipeline 3       |
| | | |                   +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | | +MultiNodeIndexSeek | cs:Science(name) WHERE name = $autostring_1, conway:Scientist(name) WHERE name = $autostring_2 |              0 |    1 |       4 |             64 |     0.172 | cs.name ASC     | In Pipeline 2       |
| | |                     +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +Filter               | wing:Scientist                                                                                 |              0 |    3 |       3 |                |           | cs.name ASC     | Fused in Pipeline 1 |
| | |                     +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +Expand(All)          | (cs)<-[anon_68:RESEARCHED]-(wing)                                                              |              0 |    3 |       4 |                |           | cs.name ASC     | Fused in Pipeline 1 |
| | |                     +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +NodeIndexSeek        | cs:Science(name) WHERE name = $autostring_1                                                    |              0 |    1 |       2 |             64 |           | cs.name ASC     | Fused in Pipeline 1 |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +Filter                 | wing:Scientist                                                                                 |              0 |    1 |       1 |                |           | liskov.name ASC | Fused in Pipeline 0 |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +Expand(All)            | (liskov)-[anon_41:KNOWS]->(wing)                                                               |              0 |    1 |       3 |                |           | liskov.name ASC | Fused in Pipeline 0 |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +NodeIndexSeek          | liskov:Scientist(name) WHERE name = $autostring_0                                              |              0 |    1 |       2 |             64 |           | liskov.name ASC | Fused in Pipeline 0 |
+-------------------------+------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+

Total database accesses: 27, total allocated memory: 2064

----

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
CREATE INDEX FOR (n:Scientist) ON (n.name)
CREATE INDEX FOR (n:Science) ON (n.name)
CALL db.awaitIndexes
CREATE
(liskov:Scientist {name: 'Liskov', born: 1939})-[:KNOWS]->(wing:Scientist {name: 'Wing', born: 1956})-[:RESEARCHED]->(cs:Science {name: 'Computer Science'})<-[:RESEARCHED]-(conway:Scientist {name: 'Conway', born: 1938}),
(liskov)-[:RESEARCHED]->(cs),
(wing)-[:RESEARCHED]->(:Science {name: 'Engineering'}),
(chemistry:Science {name: 'Chemistry'})<-[:RESEARCHED]-(:Scientist {name: 'Curie', born: 1867}),
(chemistry)<-[:RESEARCHED]-(:Scientist {name: 'Arden'}),
(chemistry)<-[:RESEARCHED]-(:Scientist {name: 'Franklin'}),
(chemistry)<-[:RESEARCHED]-(:Scientist {name: 'Harrison'})
      

]]></database><command><![CDATA[
MATCH (liskov:Scientist {name:'Liskov'})-[:KNOWS]->(wing:Scientist)-[:RESEARCHED]->(cs:Science {name:'Computer Science'})<-[:RESEARCHED]-(conway:Scientist {name: 'Conway'}) USING INDEX SEEK liskov:Scientist(name) RETURN liskov.born AS column
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]

=== Query using multiple index hints

Supplying one index hint changed the starting point of the query, but the plan is still linear, meaning it
only has one starting point. If we give the planner yet another index hint, we force it to use two starting points,
one at each end of the match. It will then join these two branches using a join operator. 


.Query
[source, cypher]
----
MATCH (liskov:Scientist {name:'Liskov'})-[:KNOWS]->(wing:Scientist)-[:RESEARCHED]->(cs:Science {name:'Computer Science'})<-[:RESEARCHED]-(conway:Scientist {name: 'Conway'}) USING INDEX liskov:Scientist(name) USING INDEX conway:Scientist(name) RETURN liskov.born AS column
----

Returns the year *'Barbara Liskov'* was born, using a slightly better plan.

.Query plan
[source]
----
Compiler CYPHER 4.1

Planner COST

Runtime PIPELINED

Runtime version 4.1

+-------------------------+------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| Operator                | Details                                                                                        | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Time (ms) | Order           | Other               |
+-------------------------+------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +ProduceResults         | column                                                                                         |              0 |    1 |       0 |                |     0.088 | cs.name ASC     | In Pipeline 5       |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +Projection             | liskov.born AS column                                                                          |              0 |    1 |       3 |                |     0.042 | cs.name ASC     | In Pipeline 5       |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +NodeHashJoin           | wing                                                                                           |              0 |    1 |       0 |            608 |     0.067 | cs.name ASC     | In Pipeline 5       |
| |\                      +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +Filter               | not anon_122 = anon_68                                                                         |              0 |    2 |       0 |                |     0.052 | cs.name ASC     | In Pipeline 4       |
| | |                     +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +NodeHashJoin         | cs                                                                                             |              0 |    3 |       0 |            720 |     0.100 | cs.name ASC     | In Pipeline 4       |
| | |\                    +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | | +Expand(Into)       | (cs)<-[anon_122:RESEARCHED]-(conway)                                                           |              0 |    1 |       5 |            952 |     0.136 | cs.name ASC     | In Pipeline 3       |
| | | |                   +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | | +MultiNodeIndexSeek | cs:Science(name) WHERE name = $autostring_1, conway:Scientist(name) WHERE name = $autostring_2 |              0 |    1 |       4 |             64 |     0.192 | cs.name ASC     | In Pipeline 2       |
| | |                     +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +Filter               | wing:Scientist                                                                                 |              0 |    3 |       3 |                |           | cs.name ASC     | Fused in Pipeline 1 |
| | |                     +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +Expand(All)          | (cs)<-[anon_68:RESEARCHED]-(wing)                                                              |              0 |    3 |       4 |                |           | cs.name ASC     | Fused in Pipeline 1 |
| | |                     +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +NodeIndexSeek        | cs:Science(name) WHERE name = $autostring_1                                                    |              0 |    1 |       2 |             64 |           | cs.name ASC     | Fused in Pipeline 1 |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +Filter                 | wing:Scientist                                                                                 |              0 |    1 |       1 |                |           | liskov.name ASC | Fused in Pipeline 0 |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +Expand(All)            | (liskov)-[anon_41:KNOWS]->(wing)                                                               |              0 |    1 |       3 |                |           | liskov.name ASC | Fused in Pipeline 0 |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +NodeIndexSeek          | liskov:Scientist(name) WHERE name = $autostring_0                                              |              0 |    1 |       2 |             64 |           | liskov.name ASC | Fused in Pipeline 0 |
+-------------------------+------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+

Total database accesses: 27, total allocated memory: 2064

----

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
CREATE INDEX FOR (n:Scientist) ON (n.name)
CREATE INDEX FOR (n:Science) ON (n.name)
CALL db.awaitIndexes
CREATE
(liskov:Scientist {name: 'Liskov', born: 1939})-[:KNOWS]->(wing:Scientist {name: 'Wing', born: 1956})-[:RESEARCHED]->(cs:Science {name: 'Computer Science'})<-[:RESEARCHED]-(conway:Scientist {name: 'Conway', born: 1938}),
(liskov)-[:RESEARCHED]->(cs),
(wing)-[:RESEARCHED]->(:Science {name: 'Engineering'}),
(chemistry:Science {name: 'Chemistry'})<-[:RESEARCHED]-(:Scientist {name: 'Curie', born: 1867}),
(chemistry)<-[:RESEARCHED]-(:Scientist {name: 'Arden'}),
(chemistry)<-[:RESEARCHED]-(:Scientist {name: 'Franklin'}),
(chemistry)<-[:RESEARCHED]-(:Scientist {name: 'Harrison'})
      

]]></database><command><![CDATA[
MATCH (liskov:Scientist {name:'Liskov'})-[:KNOWS]->(wing:Scientist)-[:RESEARCHED]->(cs:Science {name:'Computer Science'})<-[:RESEARCHED]-(conway:Scientist {name: 'Conway'}) USING INDEX liskov:Scientist(name) USING INDEX conway:Scientist(name) RETURN liskov.born AS column
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]

[[query-using-scan-hint]]
== Scan hints

If your query matches large parts of an index, it might be faster to scan the label and filter out nodes that do not match.
To do this, you can use `USING SCAN variable:Label` after the applicable `MATCH` clause.
This will force Cypher to not use an index that could have been used, and instead do a label scan.

=== Hinting a label scan

If the best performance is to be had by scanning all nodes in a label and then filtering on that set, use `USING SCAN`.


.Query
[source, cypher]
----
MATCH (s:Scientist)
USING SCAN s:Scientist
WHERE s.born < 1939
RETURN s.born AS column
----

Returns all scientists born before *'1939'*.

.Query plan
[source]
----
Compiler CYPHER 4.1

Planner COST

Runtime PIPELINED

Runtime version 4.1

+------------------+----------------------------+----------------+------+---------+----------------+---------------------+
| Operator         | Details                    | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Other               |
+------------------+----------------------------+----------------+------+---------+----------------+---------------------+
| +ProduceResults  | column                     |              3 |    2 |       0 |                | Fused in Pipeline 0 |
| |                +----------------------------+----------------+------+---------+----------------+---------------------+
| +Projection      | cache[s.born] AS column    |              3 |    2 |       0 |                | Fused in Pipeline 0 |
| |                +----------------------------+----------------+------+---------+----------------+---------------------+
| +Filter          | cache[s.born] < $autoint_0 |              3 |    2 |      18 |                | Fused in Pipeline 0 |
| |                +----------------------------+----------------+------+---------+----------------+---------------------+
| +NodeByLabelScan | s:Scientist                |             10 |    7 |       8 |             64 | Fused in Pipeline 0 |
+------------------+----------------------------+----------------+------+---------+----------------+---------------------+

Total database accesses: 26, total allocated memory: 64

----

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
CREATE INDEX FOR (n:Scientist) ON (n.name)
CREATE INDEX FOR (n:Science) ON (n.name)
CALL db.awaitIndexes
CREATE
(liskov:Scientist {name: 'Liskov', born: 1939})-[:KNOWS]->(wing:Scientist {name: 'Wing', born: 1956})-[:RESEARCHED]->(cs:Science {name: 'Computer Science'})<-[:RESEARCHED]-(conway:Scientist {name: 'Conway', born: 1938}),
(liskov)-[:RESEARCHED]->(cs),
(wing)-[:RESEARCHED]->(:Science {name: 'Engineering'}),
(chemistry:Science {name: 'Chemistry'})<-[:RESEARCHED]-(:Scientist {name: 'Curie', born: 1867}),
(chemistry)<-[:RESEARCHED]-(:Scientist {name: 'Arden'}),
(chemistry)<-[:RESEARCHED]-(:Scientist {name: 'Franklin'}),
(chemistry)<-[:RESEARCHED]-(:Scientist {name: 'Harrison'})
      

]]></database><command><![CDATA[
MATCH (s:Scientist)
USING SCAN s:Scientist
WHERE s.born < 1939
RETURN s.born AS column
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]

[[query-using-join-hint]]
== Join hints

Join hints are the most advanced type of hints, and are not used to find starting points for the
query execution plan, but to enforce that joins are made at specified points. This implies that there
has to be more than one starting point (leaf) in the plan, in order for the query to be able to join the two branches ascending
from these leaves. Due to this nature, joins, and subsequently join hints, will force
the planner to look for additional starting points, and in the case where there are no more good ones,
potentially pick a very bad starting point. This will negatively affect query performance. In other cases,
the hint might force the planner to pick a _seemingly_ bad starting point, which in reality proves to be a very good one.

=== Hinting a join on a single node

In the example above using multiple index hints, we saw that the planner chose to do a join on the `cs` node.
This means that the relationship between `wing` and `cs` was traversed in the outgoing direction, which is better
statistically because the pattern `()-[:RESEARCHED]->(:Science)` is more common than the pattern `(:Scientist)-[:RESEARCHED]->()`.
However, in the actual graph, the `cs` node only has two such relationships, so expanding from it will be beneficial
to expanding from the `wing` node. We can force the join to happen on `wing` instead with a join hint.


.Query
[source, cypher]
----
MATCH (liskov:Scientist {name:'Liskov'})-[:KNOWS]->(wing:Scientist)-[:RESEARCHED]->(cs:Science {name:'Computer Science'})<-[:RESEARCHED]-(conway:Scientist {name: 'Conway'})
USING INDEX liskov:Scientist(name)
USING INDEX conway:Scientist(name)
USING JOIN ON wing
RETURN wing.born AS column
----

Returns the birth date of *'Jeanette Wing'*, using a slightly better plan.

.Query plan
[source]
----
Compiler CYPHER 4.1

Planner COST

Runtime PIPELINED

Runtime version 4.1

+-------------------------+------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| Operator                | Details                                                                                        | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Time (ms) | Order           | Other               |
+-------------------------+------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +ProduceResults         | column                                                                                         |              0 |    1 |       0 |                |     0.058 | cs.name ASC     | In Pipeline 5       |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +Projection             | wing.born AS column                                                                            |              0 |    1 |       3 |                |     0.038 | cs.name ASC     | In Pipeline 5       |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +NodeHashJoin           | wing                                                                                           |              0 |    1 |       0 |            608 |     0.053 | cs.name ASC     | In Pipeline 5       |
| |\                      +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +Filter               | not anon_122 = anon_68                                                                         |              0 |    2 |       0 |                |     0.055 | cs.name ASC     | In Pipeline 4       |
| | |                     +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +NodeHashJoin         | cs                                                                                             |              0 |    3 |       0 |            720 |     0.127 | cs.name ASC     | In Pipeline 4       |
| | |\                    +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | | +Expand(Into)       | (cs)<-[anon_122:RESEARCHED]-(conway)                                                           |              0 |    1 |       5 |            952 |     0.142 | cs.name ASC     | In Pipeline 3       |
| | | |                   +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | | +MultiNodeIndexSeek | cs:Science(name) WHERE name = $autostring_1, conway:Scientist(name) WHERE name = $autostring_2 |              0 |    1 |       4 |             64 |     0.169 | cs.name ASC     | In Pipeline 2       |
| | |                     +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +Filter               | wing:Scientist                                                                                 |              0 |    3 |       3 |                |           | cs.name ASC     | Fused in Pipeline 1 |
| | |                     +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +Expand(All)          | (cs)<-[anon_68:RESEARCHED]-(wing)                                                              |              0 |    3 |       4 |                |           | cs.name ASC     | Fused in Pipeline 1 |
| | |                     +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +NodeIndexSeek        | cs:Science(name) WHERE name = $autostring_1                                                    |              0 |    1 |       2 |             64 |           | cs.name ASC     | Fused in Pipeline 1 |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +Filter                 | wing:Scientist                                                                                 |              0 |    1 |       1 |                |           | liskov.name ASC | Fused in Pipeline 0 |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +Expand(All)            | (liskov)-[anon_41:KNOWS]->(wing)                                                               |              0 |    1 |       3 |                |           | liskov.name ASC | Fused in Pipeline 0 |
| |                       +------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +NodeIndexSeek          | liskov:Scientist(name) WHERE name = $autostring_0                                              |              0 |    1 |       2 |             64 |           | liskov.name ASC | Fused in Pipeline 0 |
+-------------------------+------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+

Total database accesses: 27, total allocated memory: 2064

----

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
CREATE INDEX FOR (n:Scientist) ON (n.name)
CREATE INDEX FOR (n:Science) ON (n.name)
CALL db.awaitIndexes
CREATE
(liskov:Scientist {name: 'Liskov', born: 1939})-[:KNOWS]->(wing:Scientist {name: 'Wing', born: 1956})-[:RESEARCHED]->(cs:Science {name: 'Computer Science'})<-[:RESEARCHED]-(conway:Scientist {name: 'Conway', born: 1938}),
(liskov)-[:RESEARCHED]->(cs),
(wing)-[:RESEARCHED]->(:Science {name: 'Engineering'}),
(chemistry:Science {name: 'Chemistry'})<-[:RESEARCHED]-(:Scientist {name: 'Curie', born: 1867}),
(chemistry)<-[:RESEARCHED]-(:Scientist {name: 'Arden'}),
(chemistry)<-[:RESEARCHED]-(:Scientist {name: 'Franklin'}),
(chemistry)<-[:RESEARCHED]-(:Scientist {name: 'Harrison'})
      

]]></database><command><![CDATA[
MATCH (liskov:Scientist {name:'Liskov'})-[:KNOWS]->(wing:Scientist)-[:RESEARCHED]->(cs:Science {name:'Computer Science'})<-[:RESEARCHED]-(conway:Scientist {name: 'Conway'})
USING INDEX liskov:Scientist(name)
USING INDEX conway:Scientist(name)
USING JOIN ON wing
RETURN wing.born AS column
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]

=== Hinting a join on multiple nodes

The query planner can be made to produce a join between several specific points. This requires the query to expand from the same node from several directions.


.Query
[source, cypher]
----
MATCH (liskov:Scientist {name:'Liskov'})-[:KNOWS]->(wing:Scientist {name:'Wing'})-[:RESEARCHED]->(cs:Science {name:'Computer Science'})<-[:RESEARCHED]-(liskov)
USING INDEX liskov:Scientist(name)
USING JOIN ON liskov, cs
RETURN wing.born AS column
----

Returns the birth date of *'Jeanette Wing'*.

.Query plan
[source]
----
Compiler CYPHER 4.1

Planner COST

Runtime PIPELINED

Runtime version 4.1

+-----------------------+----------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| Operator              | Details                                                                                            | Estimated Rows | Rows | DB Hits | Memory (Bytes) | Time (ms) | Order           | Other               |
+-----------------------+----------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +ProduceResults       | column                                                                                             |              0 |    1 |       0 |                |     0.060 | wing.name ASC   | In Pipeline 6       |
| |                     +----------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +Projection           | wing.born AS column                                                                                |              0 |    1 |       3 |                |     0.037 | wing.name ASC   | In Pipeline 6       |
| |                     +----------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +Filter               | not anon_136 = anon_82                                                                             |              0 |    1 |       0 |                |     0.117 | wing.name ASC   | In Pipeline 6       |
| |                     +----------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +NodeHashJoin         | cs, liskov                                                                                         |              0 |    1 |       0 |            672 |     0.133 | wing.name ASC   | In Pipeline 6       |
| |\                    +----------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +NodeHashJoin       | wing                                                                                               |              0 |    1 |       0 |            620 |     0.072 | wing.name ASC   | In Pipeline 5       |
| | |\                  +----------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | | +Filter           | cs:Science AND cache[cs.name] = $autostring_2                                                      |              0 |    1 |       6 |                |           | wing.name ASC   | Fused in Pipeline 4 |
| | | |                 +----------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | | +Expand(All)      | (wing)-[anon_82:RESEARCHED]->(cs)                                                                  |              0 |    2 |       4 |                |           | wing.name ASC   | Fused in Pipeline 4 |
| | | |                 +----------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | | +NodeIndexSeek    | wing:Scientist(name) WHERE name = $autostring_1                                                    |              0 |    1 |       2 |             64 |           | wing.name ASC   | Fused in Pipeline 4 |
| | |                   +----------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +Expand(Into)       | (liskov)-[anon_41:KNOWS]->(wing)                                                                   |              0 |    1 |       4 |            952 |     0.093 | liskov.name ASC | In Pipeline 3       |
| | |                   +----------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| | +MultiNodeIndexSeek | liskov:Scientist(name) WHERE name = $autostring_0, wing:Scientist(name) WHERE name = $autostring_1 |              0 |    1 |       4 |             64 |     0.186 | liskov.name ASC | In Pipeline 2       |
| |                     +----------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +Expand(Into)         | (cs)<-[anon_136:RESEARCHED]-(liskov)                                                               |              0 |    1 |       5 |            952 |     0.499 | cs.name ASC     | In Pipeline 1       |
| |                     +----------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+
| +MultiNodeIndexSeek   | cs:Science(name) WHERE name = $autostring_2, cache[cs.name],                                       |              0 |    1 |       4 |             64 |     1.535 | cs.name ASC     | In Pipeline 0       |
|                       | liskov:Scientist(name) WHERE name = $autostring_0, cache[cs.name]                                  |                |      |         |                |           |                 |                     |
+-----------------------+----------------------------------------------------------------------------------------------------+----------------+------+---------+----------------+-----------+-----------------+---------------------+

Total database accesses: 32, total allocated memory: 1852

----

ifndef::nonhtmloutput[]
[subs="none"]
++++
<formalpara role="cypherconsole">
<title>Try this query live</title>
<para><database><![CDATA[
CREATE INDEX FOR (n:Scientist) ON (n.name)
CREATE INDEX FOR (n:Science) ON (n.name)
CALL db.awaitIndexes
CREATE
(liskov:Scientist {name: 'Liskov', born: 1939})-[:KNOWS]->(wing:Scientist {name: 'Wing', born: 1956})-[:RESEARCHED]->(cs:Science {name: 'Computer Science'})<-[:RESEARCHED]-(conway:Scientist {name: 'Conway', born: 1938}),
(liskov)-[:RESEARCHED]->(cs),
(wing)-[:RESEARCHED]->(:Science {name: 'Engineering'}),
(chemistry:Science {name: 'Chemistry'})<-[:RESEARCHED]-(:Scientist {name: 'Curie', born: 1867}),
(chemistry)<-[:RESEARCHED]-(:Scientist {name: 'Arden'}),
(chemistry)<-[:RESEARCHED]-(:Scientist {name: 'Franklin'}),
(chemistry)<-[:RESEARCHED]-(:Scientist {name: 'Harrison'})
      

]]></database><command><![CDATA[
MATCH (liskov:Scientist {name:'Liskov'})-[:KNOWS]->(wing:Scientist {name:'Wing'})-[:RESEARCHED]->(cs:Science {name:'Computer Science'})<-[:RESEARCHED]-(liskov)
USING INDEX liskov:Scientist(name)
USING JOIN ON liskov, cs
RETURN wing.born AS column
]]></command></para></formalpara>
++++
endif::nonhtmloutput[]

[[query-using-periodic-commit-hint]]
== `PERIODIC COMMIT` query hint

Importing large amounts of data using xref:clauses/load-csv.adoc[`LOAD CSV`] with a single Cypher query may fail due to memory constraints.
This will manifest itself as an `OutOfMemoryError`.

For this situation _only,_ Cypher provides the global `USING PERIODIC COMMIT` query hint for updating queries using `LOAD CSV`.
If required, the limit for the number of rows per commit may be set as follows: `USING PERIODIC COMMIT 500`.

`PERIODIC COMMIT` will process the rows until the number of rows reaches a limit.
Then the current transaction will be committed and replaced with a newly opened transaction.
If no limit is set, a default value will be used.

See xref:clauses/load-csv.adoc#load-csv-importing-large-amounts-of-data[Importing large amounts of data] in xref:clauses/load-csv.adoc[] for examples of `USING PERIODIC COMMIT` with and without setting the number of rows per commit.

[IMPORTANT]
====
Using `PERIODIC COMMIT` will prevent running out of memory when importing large amounts of data.
However, it will also break transactional isolation and thus it should only be used where needed.


====

[NOTE]
====
The xref:clauses/use.adoc[`USE` clause] can not be used together with the `PERIODIC COMMIT` clause.


====

